export default [
  {
    "code": "div111111_0",
    "words": "乾卦 卦辞:元，亨，利，贞。《象》曰：天行健，君子以自强不息。",
    "name": "乾卦卦辞"
  },
  {
    "code": "div111111_6",
    "words": "乾卦 初九爻辞:潜龙勿用。《象》曰：潜龙勿用，阳在下也。",
    "name": "乾卦初九爻辞"
  },
  {
    "code": "div111111_5",
    "words": "乾卦 九二爻辞:见龙在田，利见大人。《象》日：见龙在田，德施普也。",
    "name": "乾卦九二爻辞"
  },
  {
    "code": "div111111_4",
    "words": "乾卦 九三爻辞:君子终日乾乾，夕惕若厉，无咎。《象》曰：终日乾乾，反复道也。",
    "name": "乾卦九三爻辞"
  },
  {
    "code": "div111111_3",
    "words": "乾卦 九四爻辞:或跃在渊，无咎。《象》曰：或跃在渊，进无咎也。",
    "name": "乾卦九四爻辞"
  },
  {
    "code": "div111111_2",
    "words": "乾卦 九五爻辞:飞龙在天，利见大人。《象》曰：飞龙在天，大人造也。",
    "name": "乾卦九五爻辞"
  },
  {
    "code": "div111111_1",
    "words": "乾卦 上九爻辞:亢龙有悔。《象》日：亢龙有悔，盈不可久也。",
    "name": "乾卦上九爻辞"
  },
  {
    "code": "div000000_0",
    "words": "坤卦 卦辞:元亨，利牝马之贞。君子有攸往，先迷后得主。利西南得朋，东北丧朋。安贞吉。《象》曰：地势坤，君子以厚德载物。",
    "name": "坤卦卦辞"
  },
  {
    "code": "div000000_6",
    "words": "坤卦 初六爻辞:履霜，坚冰至。《象》曰：履霜坚冰，阴始凝也。驯致其道，至坚冰也。",
    "name": "坤卦初六爻辞"
  },
  {
    "code": "div000000_5",
    "words": "坤卦 六二爻辞:直方大，不习，无不利。《象》曰：六二之动，直以方也。不习，无不利，地道光也。",
    "name": "坤卦六二爻辞"
  },
  {
    "code": "div000000_4",
    "words": "坤卦 六三爻辞:含章可贞。或从王事，无成有终。《象》曰：含章可贞；以时发也。或从王事，知光大也。",
    "name": "坤卦六三爻辞"
  },
  {
    "code": "div000000_3",
    "words": "坤卦 六四爻辞:括囊，无咎无誉。《象》曰：括囊无咎，慎不害也。",
    "name": "坤卦六四爻辞"
  },
  {
    "code": "div000000_2",
    "words": "坤卦 六五爻辞:黄裳，元吉。《象》曰：黄裳元吉，文在中也。",
    "name": "坤卦六五爻辞"
  },
  {
    "code": "div000000_1",
    "words": "坤卦 上六爻辞:龙战于野，其血玄黄。《象》曰：龙战于野，其道穷也。",
    "name": "坤卦上六爻辞"
  },
  {
    "code": "div010001_0",
    "words": "屯卦 卦辞:元亨利贞。勿用有攸往，利建侯。《象》曰：云雷屯，君子以经纶。",
    "name": "屯卦卦辞"
  },
  {
    "code": "div010001_6",
    "words": "屯卦 初九爻辞:磐桓，利居贞，利建侯。《象》曰：虽磐桓，志行正也。以贵下贱，大得民也。",
    "name": "屯卦初九爻辞"
  },
  {
    "code": "div010001_5",
    "words": "屯卦 六二爻辞:屯如邅如，乘马班如。匪寇，婚媾，女子贞不字，十年乃字。《象》曰：六二之难，乘刚也。十年乃字，反常也。",
    "name": "屯卦六二爻辞"
  },
  {
    "code": "div010001_4",
    "words": "屯卦 六三爻辞:既鹿无虞，惟入于林中。君子几，不如舍，往吝。《象》曰：既鹿无虞，以纵禽也。君子舍之，往吝，穷也。",
    "name": "屯卦六三爻辞"
  },
  {
    "code": "div010001_3",
    "words": "屯卦 六四爻辞:乘马班如，求婚媾，往吉，无不利。《象》曰：求而往，明也。",
    "name": "屯卦六四爻辞"
  },
  {
    "code": "div010001_2",
    "words": "屯卦 九五爻辞:屯其膏，小贞吉，大贞凶。《象》曰：屯其膏，施未光也。",
    "name": "屯卦九五爻辞"
  },
  {
    "code": "div010001_1",
    "words": "屯卦 上六爻辞:乘马班如，泣血涟如。《象》曰：泣血涟如，何可长也。",
    "name": "屯卦上六爻辞"
  },
  {
    "code": "div100010_0",
    "words": "蒙卦 卦辞:亨。匪我求童蒙，童蒙求我。初噬告，再三渎，渎则不告。利贞。《象》曰：山下出泉，蒙。君子以果行育德。",
    "name": "蒙卦卦辞"
  },
  {
    "code": "div100010_6",
    "words": "蒙卦 初六爻辞:发蒙，利用刑人，用说桎梏；以往吝。《象》曰：利用刑人，以正法也。",
    "name": "蒙卦初六爻辞"
  },
  {
    "code": "div100010_5",
    "words": "蒙卦 九二爻辞:包蒙，吉。纳妇，吉；子克家。《象》曰：子克家，刚柔接也。",
    "name": "蒙卦九二爻辞"
  },
  {
    "code": "div100010_4",
    "words": "蒙卦 六三爻辞:勿用娶女，见金夫，不有躬，无攸利。《象》曰：勿用娶女，行不顺也。",
    "name": "蒙卦六三爻辞"
  },
  {
    "code": "div100010_3",
    "words": "蒙卦 六四爻辞:困蒙，吝。《象》曰：困蒙之吝，独远实也。",
    "name": "蒙卦六四爻辞"
  },
  {
    "code": "div100010_2",
    "words": "蒙卦 六五爻辞:童蒙，吉。《象》曰：童蒙之吉，顺以巽也。",
    "name": "蒙卦六五爻辞"
  },
  {
    "code": "div100010_1",
    "words": "蒙卦 上九爻辞:击蒙，不利为寇，利御寇。《象》曰：利用御寇，上下顺也。",
    "name": "蒙卦上九爻辞"
  },
  {
    "code": "div010111_0",
    "words": "需卦 卦辞:有孚，光亨，贞吉。利涉大川。《象》曰：云上於天，需。君子以饮食宴乐。",
    "name": "需卦卦辞"
  },
  {
    "code": "div010111_6",
    "words": "需卦 初九爻辞:需于郊，利用恒，无咎。《象》曰：需于郊，不犯难行也。利用恒，无咎；未失常也。",
    "name": "需卦初九爻辞"
  },
  {
    "code": "div010111_5",
    "words": "需卦 九二爻辞:需于沙，小有言，终吉。《象》曰：需于沙，衍在中也。虽小有言，以终吉也。",
    "name": "需卦九二爻辞"
  },
  {
    "code": "div010111_4",
    "words": "需卦 九三爻辞:需于泥，致寇至。《象》曰：需于泥，灾在外也。自我致寇，敬慎不败也。",
    "name": "需卦九三爻辞"
  },
  {
    "code": "div010111_3",
    "words": "需卦 六四爻辞:需于血，出自穴。《象》曰：需于血，顺以听也。",
    "name": "需卦六四爻辞"
  },
  {
    "code": "div010111_2",
    "words": "需卦 九五爻辞:需于酒食，贞吉。《象》曰：酒食贞吉，以中正也。",
    "name": "需卦九五爻辞"
  },
  {
    "code": "div010111_1",
    "words": "需卦 上六爻辞:入于穴，有不速之客三人来，敬之终吉。《象》曰：不速之客来，敬之终吉。虽不当位，未大失也。",
    "name": "需卦上六爻辞"
  },
  {
    "code": "div111010_0",
    "words": "讼卦 卦辞:有孚，窒惕，中吉。终凶。利见大人，不利涉大川。《象》曰：天与水违行，讼。君子以作事谋始。",
    "name": "讼卦卦辞"
  },
  {
    "code": "div111010_6",
    "words": "讼卦 初六爻辞:不永所事，小有言，终吉。《象》曰：不永所事，讼不可长也。虽有小言，其辩明也。",
    "name": "讼卦初六爻辞"
  },
  {
    "code": "div111010_5",
    "words": "讼卦 九二爻辞:不克讼，归而逋，其邑人三百户无眚。《象》曰：不克讼，归逋窜也。自下讼上，患至掇也。",
    "name": "讼卦九二爻辞"
  },
  {
    "code": "div111010_4",
    "words": "讼卦 六三爻辞:食旧德，贞厉，终吉。或从王事，无成。《象》曰：食旧德，从上吉也。",
    "name": "讼卦六三爻辞"
  },
  {
    "code": "div111010_3",
    "words": "讼卦 九四爻辞:不克讼，复自命，渝安贞，吉。《象》曰：复即命，渝安贞；不失也。",
    "name": "讼卦九四爻辞"
  },
  {
    "code": "div111010_2",
    "words": "讼卦 九五爻辞:讼，元吉。《象》曰：讼，元吉，以中正也。",
    "name": "讼卦九五爻辞"
  },
  {
    "code": "div111010_1",
    "words": "讼卦 上九爻辞:或锡之鞶带，终朝三褫之。《象》曰：以讼受福，亦不足敬也。",
    "name": "讼卦上九爻辞"
  },
  {
    "code": "div000010_0",
    "words": "师卦 卦辞:贞，丈人吉，无咎。《象》曰：地中有水，师，君子以容民蓄众。",
    "name": "师卦卦辞"
  },
  {
    "code": "div000010_6",
    "words": "师卦 初六爻辞:师出以律，否臧凶。《象》曰：师出以律，失律凶也。",
    "name": "师卦初六爻辞"
  },
  {
    "code": "div000010_5",
    "words": "师卦 九二爻辞:在师，中吉，无咎，王三锡命。《象》曰：在师中吉，承天宠也。王三锡命，怀万邦也。",
    "name": "师卦九二爻辞"
  },
  {
    "code": "div000010_4",
    "words": "师卦 六三爻辞:师或舆尸，凶。《象》曰：师或舆尸，大无功也。",
    "name": "师卦六三爻辞"
  },
  {
    "code": "div000010_3",
    "words": "师卦 六四爻辞:师左次，无咎。《象》曰：左次无咎，未失常也。",
    "name": "师卦六四爻辞"
  },
  {
    "code": "div000010_2",
    "words": "师卦 六五爻辞:田有禽，利执；言，无咎。长子帅师，弟子舆尸，贞凶。《象》曰：长子帅师，以中行也。弟子舆师，使不当也。",
    "name": "师卦六五爻辞"
  },
  {
    "code": "div000010_1",
    "words": "师卦 上六爻辞:大君有命，开国承家，小人勿用。《象》曰：大君有命，以正功也。小人勿用，必乱邦也。",
    "name": "师卦上六爻辞"
  },
  {
    "code": "div010000_0",
    "words": "比卦 卦辞:吉。原筮，元永贞，无咎。不宁方来，后夫凶。《象》曰：地上有水，比。先王以建万国，亲诸侯。",
    "name": "比卦卦辞"
  },
  {
    "code": "div010000_6",
    "words": "比卦 初六爻辞:有孚比之，无咎。有孚盈缶，终来有它吉。《象》曰：比之初六，有它吉也。",
    "name": "比卦初六爻辞"
  },
  {
    "code": "div010000_5",
    "words": "比卦 六二爻辞:比之自内，贞吉。《象》曰：比之自内，不自失也。",
    "name": "比卦六二爻辞"
  },
  {
    "code": "div010000_4",
    "words": "比卦 六三爻辞:比之匪人。《象》曰：比之匪人，不亦伤乎？",
    "name": "比卦六三爻辞"
  },
  {
    "code": "div010000_3",
    "words": "比卦 六四爻辞:外比之，贞吉。《象》曰：外比于贤，以从上也。",
    "name": "比卦六四爻辞"
  },
  {
    "code": "div010000_2",
    "words": "比卦 九五爻辞:显比，王用三驱，失前禽。邑人不诫，吉。《象》曰：显比之吉，位正中也。舍逆取顺，失前禽也。邑人不诫，上使中也。",
    "name": "比卦九五爻辞"
  },
  {
    "code": "div010000_1",
    "words": "比卦 上六爻辞:比之无首，凶。《象》曰：比之无首，无所终也。",
    "name": "比卦上六爻辞"
  },
  {
    "code": "div110111_0",
    "words": "小畜卦 卦辞:亨。密云不雨，自我西郊。《象》曰：风行天上，小畜。君子以懿文德。",
    "name": "小畜卦卦辞"
  },
  {
    "code": "div110111_6",
    "words": "小畜卦 初九爻辞:复自道，何其咎？吉。《象》曰：复自道，其义吉也。",
    "name": "小畜卦初九爻辞"
  },
  {
    "code": "div110111_5",
    "words": "小畜卦 九二爻辞:牵复，吉。《象》曰：牵复在中，亦不自失也。",
    "name": "小畜卦九二爻辞"
  },
  {
    "code": "div110111_4",
    "words": "小畜卦 九三爻辞:舆说辐，夫妻反目。《象》曰：夫妻反目，不能正室也。",
    "name": "小畜卦九三爻辞"
  },
  {
    "code": "div110111_3",
    "words": "小畜卦 六四爻辞:有孚，血去惕出，无咎。《象》曰：有孚惕出，上合志也。",
    "name": "小畜卦六四爻辞"
  },
  {
    "code": "div110111_2",
    "words": "小畜卦 九五爻辞:有孚挛如，富以其邻。《象》曰：有孚挛如，不独富也。",
    "name": "小畜卦九五爻辞"
  },
  {
    "code": "div110111_1",
    "words": "小畜卦 上九爻辞:既雨既处，尚德载。妇贞厉。月几望，君子征凶。《象》曰：既雨既处，德积载也。君子征凶，有所疑也。",
    "name": "小畜卦上九爻辞"
  },
  {
    "code": "div111011_0",
    "words": "履卦 卦辞:履虎尾，不咥人，亨。《象》曰：上天下泽，履。君子以辨上下，定民志。",
    "name": "履卦卦辞"
  },
  {
    "code": "div111011_6",
    "words": "履卦 初九爻辞:素履往，无咎。《象》曰：素履之往，独行愿也。",
    "name": "履卦初九爻辞"
  },
  {
    "code": "div111011_5",
    "words": "履卦 九二爻辞:履道坦坦，幽人贞吉。《象》曰：幽人贞吉，中不自乱也。",
    "name": "履卦九二爻辞"
  },
  {
    "code": "div111011_4",
    "words": "履卦 六三爻辞:眇能视，跛能履。履虎尾，咥人，凶。武人为于大君。《象》曰：眇能视，不足以有明也。跛能履，不足以与行也。咥人之凶，位不当也。武人为于大君，志刚也。",
    "name": "履卦六三爻辞"
  },
  {
    "code": "div111011_3",
    "words": "履卦 九四爻辞:履虎尾，愬愬，终吉。《象》曰：愬愬终吉，志行也。",
    "name": "履卦九四爻辞"
  },
  {
    "code": "div111011_2",
    "words": "履卦 九五爻辞:夬履，贞厉。《象》曰：夬履贞厉，位正当也。",
    "name": "履卦九五爻辞"
  },
  {
    "code": "div111011_1",
    "words": "履卦 上九爻辞:视履考祥，其旋元吉。《象》曰：元吉在上，大有庆也。",
    "name": "履卦上九爻辞"
  },
  {
    "code": "div000111_0",
    "words": "泰卦 卦辞:小往大来，吉亨。《象》曰：天地交，泰。后以财成天地之道，辅相天地之宜，以左右民。",
    "name": "泰卦卦辞"
  },
  {
    "code": "div000111_6",
    "words": "泰卦 初九爻辞:拔茅茹，以其汇，征吉。《象》曰：拔茅征吉，志在外也。",
    "name": "泰卦初九爻辞"
  },
  {
    "code": "div000111_5",
    "words": "泰卦 九二爻辞:包荒，用冯河，不遐遗。朋亡，得尚于中行。《象》曰：包荒，得尚于中行，以光大也。",
    "name": "泰卦九二爻辞"
  },
  {
    "code": "div000111_4",
    "words": "泰卦 九三爻辞:无平不陂，无往不复，艰贞无咎。勿恤其孚，于食有福。《象》曰：无往不复，天地际也。",
    "name": "泰卦九三爻辞"
  },
  {
    "code": "div000111_3",
    "words": "泰卦 六四爻辞:翩翩，不富以其邻，不戒以孚。《象》曰：翩翩不富，皆失实也。不戒以孚，中心愿也。",
    "name": "泰卦六四爻辞"
  },
  {
    "code": "div000111_2",
    "words": "泰卦 六五爻辞:帝乙归妹，以祉元吉。《象》曰：以祉元吉，中以行愿也。",
    "name": "泰卦六五爻辞"
  },
  {
    "code": "div000111_1",
    "words": "泰卦 上六爻辞:城复于隍，勿用师。自邑告命，贞吝。《象》曰：城复于隍，其命乱也。",
    "name": "泰卦上六爻辞"
  },
  {
    "code": "div111000_0",
    "words": "否卦 卦辞:否之匪人，不利君子贞，大往小来。《象》曰：天地不交，否。君子以俭德辟难，不可荣以禄。",
    "name": "否卦卦辞"
  },
  {
    "code": "div111000_6",
    "words": "否卦 初六爻辞:拔茅茹，以其汇，贞吉，亨。《象》曰：拔茅贞吉，志在君也。",
    "name": "否卦初六爻辞"
  },
  {
    "code": "div111000_5",
    "words": "否卦 六二爻辞:包承，小人吉，大人否，亨。《象》曰：大人否，亨，不乱群也。",
    "name": "否卦六二爻辞"
  },
  {
    "code": "div111000_4",
    "words": "否卦 六三爻辞:包羞。《象》曰：包羞，位不当也。",
    "name": "否卦六三爻辞"
  },
  {
    "code": "div111000_3",
    "words": "否卦 九四爻辞:有命无咎，畴离祉。《象》曰：有命无咎，志行也。",
    "name": "否卦九四爻辞"
  },
  {
    "code": "div111000_2",
    "words": "否卦 九五爻辞:休否，大人吉。其亡其亡，系于苞桑。《象》曰：大人之吉，位正当也。",
    "name": "否卦九五爻辞"
  },
  {
    "code": "div111000_1",
    "words": "否卦 上九爻辞:倾否，先否后喜。《象》曰：否终则倾，何可长也。",
    "name": "否卦上九爻辞"
  },
  {
    "code": "div111101_0",
    "words": "同人卦 卦辞:同人于野，亨。利涉大川，利君子贞。《象》曰：天与火，同人。君子以类族辨物。",
    "name": "同人卦卦辞"
  },
  {
    "code": "div111101_6",
    "words": "同人卦 初九爻辞:同人于门，无咎。《象》曰：出门同人，又谁咎也。",
    "name": "同人卦初九爻辞"
  },
  {
    "code": "div111101_5",
    "words": "同人卦 六二爻辞:同人于宗，吝。《象》曰：同人于宗，吝道也。",
    "name": "同人卦六二爻辞"
  },
  {
    "code": "div111101_4",
    "words": "同人卦 九三爻辞:伏戎于莽，升其高陵，三岁不兴。《象》曰：伏戎于莽，敌刚也。三岁不兴，安行也。",
    "name": "同人卦九三爻辞"
  },
  {
    "code": "div111101_3",
    "words": "同人卦 九四爻辞:乘其墉，弗克攻，吉。《象》曰：乘其墉，义弗克也，其吉，则困而反则也。",
    "name": "同人卦九四爻辞"
  },
  {
    "code": "div111101_2",
    "words": "同人卦 九五爻辞:同人，先号咷而后笑。大师克相遇。《象》曰：同人之先，以中直也。大师相遇，言相克也。",
    "name": "同人卦九五爻辞"
  },
  {
    "code": "div111101_1",
    "words": "同人卦 上九爻辞:同人于郊，无悔。《象》曰：同人于郊，志未得也。",
    "name": "同人卦上九爻辞"
  },
  {
    "code": "div101111_0",
    "words": "大有卦 卦辞:元亨。《象》曰：火在天上，大有。君子以遏恶扬善，顺天休命。",
    "name": "大有卦卦辞"
  },
  {
    "code": "div101111_6",
    "words": "大有卦 初九爻辞:无交害，匪咎，艰则无咎。《象》曰：大有初九，无交害也。",
    "name": "大有卦初九爻辞"
  },
  {
    "code": "div101111_5",
    "words": "大有卦 九二爻辞:大车以载，有攸往，无咎。《象》曰：大车以载，积中不败也。",
    "name": "大有卦九二爻辞"
  },
  {
    "code": "div101111_4",
    "words": "大有卦 九三爻辞:公用亨于天子，小人弗克。《象》曰：公用亨于天子，小人害也。",
    "name": "大有卦九三爻辞"
  },
  {
    "code": "div101111_3",
    "words": "大有卦 九四爻辞:匪其彭，无咎。《象》曰：匪其彭，无咎，明辨晰也。",
    "name": "大有卦九四爻辞"
  },
  {
    "code": "div101111_2",
    "words": "大有卦 六五爻辞:厥孚交如，威如，吉。《象》曰：厥孚交如，信以发志也。威如之吉，易而无备也。",
    "name": "大有卦六五爻辞"
  },
  {
    "code": "div101111_1",
    "words": "大有卦 上九爻辞:自天佑之，吉无不利。《象》曰：大有上吉，自天佑也。",
    "name": "大有卦上九爻辞"
  },
  {
    "code": "div000100_0",
    "words": "谦卦 卦辞:亨，君子有终。《象》曰：地中有山，谦。君子以裒多益寡，称物平施。",
    "name": "谦卦卦辞"
  },
  {
    "code": "div000100_6",
    "words": "谦卦 初六爻辞:谦谦君子，用涉大川，吉。《象》曰：谦谦君子，卑以自牧也。",
    "name": "谦卦初六爻辞"
  },
  {
    "code": "div000100_5",
    "words": "谦卦 六二爻辞:鸣谦，贞吉。《象》曰：鸣谦贞吉，中心得也。",
    "name": "谦卦六二爻辞"
  },
  {
    "code": "div000100_4",
    "words": "谦卦 九三爻辞:劳谦君子，有终，吉。《象》曰：劳谦君子，万民服也。",
    "name": "谦卦九三爻辞"
  },
  {
    "code": "div000100_3",
    "words": "谦卦 六四爻辞:无不利，㧑谦。《象》曰：无不利，㧑谦，不违则也。",
    "name": "谦卦六四爻辞"
  },
  {
    "code": "div000100_2",
    "words": "谦卦 六五爻辞:不富以其邻，利用侵伐，无不利。《象》曰：利用侵伐，征不服也。",
    "name": "谦卦六五爻辞"
  },
  {
    "code": "div000100_1",
    "words": "谦卦 上六爻辞:鸣谦，利用行师，征邑国。《象》曰：鸣谦，志未得也。可用行师，征邑国也。",
    "name": "谦卦上六爻辞"
  },
  {
    "code": "div001000_0",
    "words": "豫卦 卦辞:利建侯行师。《象》曰：雷出地奋，豫。先王以作乐崇德，殷荐之上帝，以配祖考。",
    "name": "豫卦卦辞"
  },
  {
    "code": "div001000_6",
    "words": "豫卦 初六爻辞:鸣豫，凶。《象》曰：初六鸣豫，志穷凶也。",
    "name": "豫卦初六爻辞"
  },
  {
    "code": "div001000_5",
    "words": "豫卦 六二爻辞:介于石，不终日，贞吉。《象》曰：不终日，贞吉；以中正也。",
    "name": "豫卦六二爻辞"
  },
  {
    "code": "div001000_4",
    "words": "豫卦 六三爻辞:盱豫，悔。迟有悔。《象》曰：盱豫有悔，位不当也。",
    "name": "豫卦六三爻辞"
  },
  {
    "code": "div001000_3",
    "words": "豫卦 九四爻辞:由豫，大有得。勿疑，朋盍簪。《象》曰：由豫大有得，志大行也。",
    "name": "豫卦九四爻辞"
  },
  {
    "code": "div001000_2",
    "words": "豫卦 六五爻辞:贞疾，恒不死。《象》曰：六五贞疾，乘刚也。恒不死，中未亡也。",
    "name": "豫卦六五爻辞"
  },
  {
    "code": "div001000_1",
    "words": "豫卦 上六爻辞:冥豫，成有渝，无咎。《象》曰：冥豫在上，何可长也？",
    "name": "豫卦上六爻辞"
  },
  {
    "code": "div011001_0",
    "words": "随卦 卦辞:元亨利贞，无咎。《象》曰：泽中有雷，随。君子以向晦入宴息。",
    "name": "随卦卦辞"
  },
  {
    "code": "div011001_6",
    "words": "随卦 初九爻辞:官有渝，贞吉。出门交有功。《象》曰：官有渝，从正吉也。出门交有功，不失也。",
    "name": "随卦初九爻辞"
  },
  {
    "code": "div011001_5",
    "words": "随卦 六二爻辞:系小子，失丈夫。《象》曰：系小子，弗兼与也。",
    "name": "随卦六二爻辞"
  },
  {
    "code": "div011001_4",
    "words": "随卦 六三爻辞:系丈夫，失小子。随有求，得，利居贞。《象》曰：系丈夫，志舍下也。",
    "name": "随卦六三爻辞"
  },
  {
    "code": "div011001_3",
    "words": "随卦 九四爻辞:随有获，贞凶。有孚，在道以明，何咎？《象》曰：随有获，其义凶也。有孚在道，明功也。",
    "name": "随卦九四爻辞"
  },
  {
    "code": "div011001_2",
    "words": "随卦 九五爻辞:孚于嘉，吉。《象》曰：孚于嘉吉，位正中也。",
    "name": "随卦九五爻辞"
  },
  {
    "code": "div011001_1",
    "words": "随卦 上六爻辞:拘系之，乃从维之。王用亨于西山。《象》曰：拘系之，上穷也。",
    "name": "随卦上六爻辞"
  },
  {
    "code": "div100110_0",
    "words": "蛊卦 卦辞:元亨，利涉大川。先甲三日，后甲三日。《象》曰：山下有风，蛊。君子以振民育德。",
    "name": "蛊卦卦辞"
  },
  {
    "code": "div100110_6",
    "words": "蛊卦 初六爻辞:干父之蛊，有子，考无咎，厉终吉。《象》曰：干父之蛊，意承考也。",
    "name": "蛊卦初六爻辞"
  },
  {
    "code": "div100110_5",
    "words": "蛊卦 九二爻辞:干母之蛊，不可贞。《象》曰：干母之蛊，得中道也。",
    "name": "蛊卦九二爻辞"
  },
  {
    "code": "div100110_4",
    "words": "蛊卦 九三爻辞:干父之蛊，小有晦，无大咎。《象》曰：干父之蛊，终无咎也。",
    "name": "蛊卦九三爻辞"
  },
  {
    "code": "div100110_3",
    "words": "蛊卦 六四爻辞:裕父之蛊，往见吝。《象》曰：裕父之蛊，往未得也。",
    "name": "蛊卦六四爻辞"
  },
  {
    "code": "div100110_2",
    "words": "蛊卦 六五爻辞:干父之蛊，用誉。《象》曰：干父用誉，承以德也。",
    "name": "蛊卦六五爻辞"
  },
  {
    "code": "div100110_1",
    "words": "蛊卦 上九爻辞:不事王侯，高尚其事。《象》曰：不事王侯，志可则也。",
    "name": "蛊卦上九爻辞"
  },
  {
    "code": "div000011_0",
    "words": "临卦 卦辞:元，亨，利，贞。至于八月有凶。《象》曰：泽上有地，临。君子以教思无穷，容保民无疆。",
    "name": "临卦卦辞"
  },
  {
    "code": "div000011_6",
    "words": "临卦 初九爻辞:咸临，贞吉。《象》曰：咸临贞吉，志行正也。",
    "name": "临卦初九爻辞"
  },
  {
    "code": "div000011_5",
    "words": "临卦 九二爻辞:咸临，吉，无不利。《象》曰：咸临，吉，无不利，未顺命也。",
    "name": "临卦九二爻辞"
  },
  {
    "code": "div000011_4",
    "words": "临卦 六三爻辞:甘临，无攸利。既忧之，无咎。《象》曰：甘临，位不当也。既忧之，咎不长也。",
    "name": "临卦六三爻辞"
  },
  {
    "code": "div000011_3",
    "words": "临卦 六四爻辞:至临，无咎。《象》曰：至临无咎，位当也。",
    "name": "临卦六四爻辞"
  },
  {
    "code": "div000011_2",
    "words": "临卦 六五爻辞:知临，大君之宜，吉。《象》曰：大君之宜，行中之谓也。",
    "name": "临卦六五爻辞"
  },
  {
    "code": "div000011_1",
    "words": "临卦 上六爻辞:敦临，吉，无咎。《象》曰：敦临之吉，志在内也。",
    "name": "临卦上六爻辞"
  },
  {
    "code": "div110000_0",
    "words": "观卦 卦辞:盥而不荐，有孚颙若。《象》曰：风行地上，观。先王以省方观民设教.",
    "name": "观卦卦辞"
  },
  {
    "code": "div110000_6",
    "words": "观卦 初六爻辞:童观，小人无咎，君子吝。《象》曰：初六童观，小人道也。",
    "name": "观卦初六爻辞"
  },
  {
    "code": "div110000_5",
    "words": "观卦 六二爻辞:窥观，利女贞。《象》曰：窥观女贞，亦可丑也。",
    "name": "观卦六二爻辞"
  },
  {
    "code": "div110000_4",
    "words": "观卦 六三爻辞:观我生，进退。《象》曰：观我生进退，未失道也。",
    "name": "观卦六三爻辞"
  },
  {
    "code": "div110000_3",
    "words": "观卦 六四爻辞:观国之光，利用宾于王。《象》曰：观国之光，尚宾也。",
    "name": "观卦六四爻辞"
  },
  {
    "code": "div110000_2",
    "words": "观卦 九五爻辞:观我生，君子无咎。《象》曰：观我生，观民也。",
    "name": "观卦九五爻辞"
  },
  {
    "code": "div110000_1",
    "words": "观卦 上九爻辞:观其生，君子无咎。《象》曰：观其生，志未平也。",
    "name": "观卦上九爻辞"
  },
  {
    "code": "div101001_0",
    "words": "噬嗑卦 卦辞:亨。利用狱。《象》曰：雷电噬嗑。先王以明罚敕法。",
    "name": "噬嗑卦卦辞"
  },
  {
    "code": "div101001_6",
    "words": "噬嗑卦 初九爻辞:履校灭趾，无咎。《象》曰：履校灭趾，不行也。",
    "name": "噬嗑卦初九爻辞"
  },
  {
    "code": "div101001_5",
    "words": "噬嗑卦 六二爻辞:噬肤灭鼻，无咎。《象》曰：噬肤灭鼻，乘刚也。",
    "name": "噬嗑卦六二爻辞"
  },
  {
    "code": "div101001_4",
    "words": "噬嗑卦 六三爻辞:噬腊肉，遇毒。小吝，无咎。《象》曰：遇毒，位不当也。",
    "name": "噬嗑卦六三爻辞"
  },
  {
    "code": "div101001_3",
    "words": "噬嗑卦 九四爻辞:“噬干胏，得金矢。利艰贞，吉。《象》曰：利艰贞吉，未光也。",
    "name": "噬嗑卦九四爻辞"
  },
  {
    "code": "div101001_2",
    "words": "噬嗑卦 六五爻辞:噬干肉得黄金。贞厉，无咎。《象》曰：贞厉无咎，得当也。",
    "name": "噬嗑卦六五爻辞"
  },
  {
    "code": "div101001_1",
    "words": "噬嗑卦 上九爻辞:何校灭耳，凶。《象》曰：何校灭耳，聪不明也。",
    "name": "噬嗑卦上九爻辞"
  },
  {
    "code": "div100101_0",
    "words": "贲卦 卦辞:亨。小利有所往。《象》曰：山下有火，贲。君子以明庶政，无敢折狱。",
    "name": "贲卦卦辞"
  },
  {
    "code": "div100101_6",
    "words": "贲卦 初九爻辞:贲其趾，舍车而徒。《象》曰：舍车而徒，义弗乘也。",
    "name": "贲卦初九爻辞"
  },
  {
    "code": "div100101_5",
    "words": "贲卦 六二爻辞:贲其须。《象》曰：贲其须，与上兴也。",
    "name": "贲卦六二爻辞"
  },
  {
    "code": "div100101_4",
    "words": "贲卦 九三爻辞:贲如，濡如，永贞吉。《象》曰：永贞之吉，终莫之陵也。",
    "name": "贲卦九三爻辞"
  },
  {
    "code": "div100101_3",
    "words": "贲卦 六四爻辞:贲如，皤如，白马翰如，匪寇婚媾。《象》曰：六四，当位疑也。匪寇婚媾，终无尤也。",
    "name": "贲卦六四爻辞"
  },
  {
    "code": "div100101_2",
    "words": "贲卦 六五爻辞:贲于丘园，束帛戋戋。吝，终吉。《象》曰：六五之吉，有喜也。",
    "name": "贲卦六五爻辞"
  },
  {
    "code": "div100101_1",
    "words": "贲卦 上九爻辞:白贲，无咎。《象》曰：白贲无咎，上得志也。",
    "name": "贲卦上九爻辞"
  },
  {
    "code": "div100000_0",
    "words": "剥卦 卦辞:不利有攸往。《象》曰：山附地上，剥。上以厚下安宅。",
    "name": "剥卦卦辞"
  },
  {
    "code": "div100000_6",
    "words": "剥卦 初六爻辞:剥床以足，蔑贞，凶。《象》曰：剥床以足，以灭下也。",
    "name": "剥卦初六爻辞"
  },
  {
    "code": "div100000_5",
    "words": "剥卦 六二爻辞:剥床以辨，蔑贞，凶。《象》曰：剥床以辨，未有与也。",
    "name": "剥卦六二爻辞"
  },
  {
    "code": "div100000_4",
    "words": "剥卦 六三爻辞:剥之，无咎。《象》曰：剥之无咎，失上下也。",
    "name": "剥卦六三爻辞"
  },
  {
    "code": "div100000_3",
    "words": "剥卦 六四爻辞:剥床以肤，凶。《象》曰：剥床以肤，切近灾也。",
    "name": "剥卦六四爻辞"
  },
  {
    "code": "div100000_2",
    "words": "剥卦 六五爻辞:贯鱼。以宫人宠，无不利。《象》曰：以宫人宠，终无尤也。",
    "name": "剥卦六五爻辞"
  },
  {
    "code": "div100000_1",
    "words": "剥卦 上九爻辞:硕果不食，君子得舆，小人剥庐。《象》曰：君子得舆，民所载也。小人剥庐，终不可用也。",
    "name": "剥卦上九爻辞"
  },
  {
    "code": "div000001_0",
    "words": "复卦 卦辞:亨。出入无疾，朋来无咎。反复其道，七日来复，利有攸往。《象》曰：雷在地中，复。先王以至日闭关，商旅不行，后不省方。",
    "name": "复卦卦辞"
  },
  {
    "code": "div000001_6",
    "words": "复卦 初九爻辞:不远复，无祗悔，元吉。《象》曰：不远之复，以修身也。",
    "name": "复卦初九爻辞"
  },
  {
    "code": "div000001_5",
    "words": "复卦 六二爻辞:休复，吉。《象》曰：休复之吉，以下仁也。",
    "name": "复卦六二爻辞"
  },
  {
    "code": "div000001_4",
    "words": "复卦 六三爻辞:频复，厉，无咎。《象》曰：频复之厉，义无咎也。",
    "name": "复卦六三爻辞"
  },
  {
    "code": "div000001_3",
    "words": "复卦 六四爻辞:中行独复。《象》曰：中行独复，以从道也。",
    "name": "复卦六四爻辞"
  },
  {
    "code": "div000001_2",
    "words": "复卦 六五爻辞:敦复，无悔。《象》曰：敦复无悔，中以自考也。",
    "name": "复卦六五爻辞"
  },
  {
    "code": "div000001_1",
    "words": "复卦 上六爻辞:迷复，凶，有灾眚。用行师，终有大败，以其国君凶，至于十年，不克征。《象》曰：迷复之凶，反君道也。",
    "name": "复卦上六爻辞"
  },
  {
    "code": "div111001_0",
    "words": "无妄卦 卦辞:元亨利贞。其匪正有眚，不利有攸往。《象》曰：天下雷行，物与无妄。先王以茂对时，育万物。",
    "name": "无妄卦卦辞"
  },
  {
    "code": "div111001_6",
    "words": "无妄卦 初九爻辞:无妄，往吉。《象》曰：无妄之往，得志也。",
    "name": "无妄卦初九爻辞"
  },
  {
    "code": "div111001_5",
    "words": "无妄卦 六二爻辞:不耕获，不菑畲，则利有攸往。《象》曰：不耕获，未富也。",
    "name": "无妄卦六二爻辞"
  },
  {
    "code": "div111001_4",
    "words": "无妄卦 六三爻辞:无妄之灾。或系之牛，行人之得，邑人之灾。《象》曰：行人得牛，邑人灾也。",
    "name": "无妄卦六三爻辞"
  },
  {
    "code": "div111001_3",
    "words": "无妄卦 九四爻辞:可贞，无咎。《象》曰：象曰：可贞无咎，固有之也。",
    "name": "无妄卦九四爻辞"
  },
  {
    "code": "div111001_2",
    "words": "无妄卦 九五爻辞:无妄之疾，勿药有喜。《象》曰：无妄之药，不可试也。",
    "name": "无妄卦九五爻辞"
  },
  {
    "code": "div111001_1",
    "words": "无妄卦 上九爻辞:无妄，行有眚，无攸利。《象》曰：无妄之行，穷之灾也。",
    "name": "无妄卦上九爻辞"
  },
  {
    "code": "div100111_0",
    "words": "大畜卦 卦辞:利贞，不家食吉，利涉大川。《象》曰：天在山中，大畜。君子以多识前言往行，以畜其德。",
    "name": "大畜卦卦辞"
  },
  {
    "code": "div100111_6",
    "words": "大畜卦 初九爻辞:有厉，利已。《象》曰：有厉利已，不犯灾也。",
    "name": "大畜卦初九爻辞"
  },
  {
    "code": "div100111_5",
    "words": "大畜卦 九二爻辞:舆说辐。《象》曰：舆说辐，中无尤也。",
    "name": "大畜卦九二爻辞"
  },
  {
    "code": "div100111_4",
    "words": "大畜卦 九三爻辞:良马逐，利艰贞。曰闲舆卫，利有攸往。《象》曰：利有攸往，上合志也。",
    "name": "大畜卦九三爻辞"
  },
  {
    "code": "div100111_3",
    "words": "大畜卦 六四爻辞:童牛之牿，元吉。《象》曰：六四元吉，有喜也。",
    "name": "大畜卦六四爻辞"
  },
  {
    "code": "div100111_2",
    "words": "大畜卦 六五爻辞:豶豕之牙，吉。《象》曰：六五之吉，有庆也。",
    "name": "大畜卦六五爻辞"
  },
  {
    "code": "div100111_1",
    "words": "大畜卦 上九爻辞:何天之衢，亨。《象》曰：何天之衢，道大行也。",
    "name": "大畜卦上九爻辞"
  },
  {
    "code": "div100001_0",
    "words": "颐卦 卦辞:贞吉。观颐，自求口实。《象》曰：山下有雷，颐。君子以慎言语，节饮食。",
    "name": "颐卦卦辞"
  },
  {
    "code": "div100001_6",
    "words": "颐卦 初九爻辞:舍尔灵龟，观我朵颐，凶。《象》曰：观我朵颐，亦不足贵也。",
    "name": "颐卦初九爻辞"
  },
  {
    "code": "div100001_5",
    "words": "颐卦 六二爻辞:颠颐，拂经，于丘颐，征凶。《象》曰：六二征凶，行失类也。",
    "name": "颐卦六二爻辞"
  },
  {
    "code": "div100001_4",
    "words": "颐卦 六三爻辞:拂颐，贞凶。十年勿用，无攸利。《象》曰：十年勿用，道大悖也。",
    "name": "颐卦六三爻辞"
  },
  {
    "code": "div100001_3",
    "words": "颐卦 六四爻辞:颠颐，吉。虎视眈眈，其欲逐逐，无咎。《象》曰：颠颐之吉，上施光也。",
    "name": "颐卦六四爻辞"
  },
  {
    "code": "div100001_2",
    "words": "颐卦 六五爻辞:拂经，居贞吉，不可涉大川。《象》曰：居贞之吉，顺以从上也。",
    "name": "颐卦六五爻辞"
  },
  {
    "code": "div100001_1",
    "words": "颐卦 上九爻辞:由颐，厉吉。利涉大川。《象》曰：由颐厉吉，大有庆也。",
    "name": "颐卦上九爻辞"
  },
  {
    "code": "div011110_0",
    "words": "大过卦 卦辞:栋桡，利有攸往，亨。《象》曰：泽灭木，大过。君子以独立不惧，遯世无闷。",
    "name": "大过卦卦辞"
  },
  {
    "code": "div011110_6",
    "words": "大过卦 初六爻辞:藉用白茅，无咎。《象》曰：藉用白茅，柔在下也。",
    "name": "大过卦初六爻辞"
  },
  {
    "code": "div011110_5",
    "words": "大过卦 九二爻辞:枯杨生稊，老夫得其女妻，无不利。《象》曰：老夫女妻，过以相与也。",
    "name": "大过卦九二爻辞"
  },
  {
    "code": "div011110_4",
    "words": "大过卦 九三爻辞:栋桡，凶。《象》曰：栋桡之凶，不可以有辅也。",
    "name": "大过卦九三爻辞"
  },
  {
    "code": "div011110_3",
    "words": "大过卦 九四爻辞:栋隆，吉。它吝。《象》曰：栋隆之吉，不桡乎下也。",
    "name": "大过卦九四爻辞"
  },
  {
    "code": "div011110_2",
    "words": "大过卦 九五爻辞:枯杨生华，老妇得士夫，无咎无誉。《象》曰：枯杨生华，何可久也？老妇士夫，亦可丑也。",
    "name": "大过卦九五爻辞"
  },
  {
    "code": "div011110_1",
    "words": "大过卦 上六爻辞:过涉灭顶，凶，无咎。《象》曰：过涉之凶，不可咎也。",
    "name": "大过卦上六爻辞"
  },
  {
    "code": "div010010_0",
    "words": "坎卦 卦辞:习坎，有孚。维心亨。行有尚。《象》曰：水洊至，习坎。君子以常德行，习教事。",
    "name": "坎卦卦辞"
  },
  {
    "code": "div010010_6",
    "words": "坎卦 初六爻辞:习坎，入于坎窞，凶。《象》曰：习坎入坎，失道凶也。",
    "name": "坎卦初六爻辞"
  },
  {
    "code": "div010010_5",
    "words": "坎卦 九二爻辞:坎有险，求小得。《象》曰：求小得，未出中也。",
    "name": "坎卦九二爻辞"
  },
  {
    "code": "div010010_4",
    "words": "坎卦 六三爻辞:来之坎坎，险且枕，入于坎窞，勿用。《象》曰：来之坎坎，终无功也。",
    "name": "坎卦六三爻辞"
  },
  {
    "code": "div010010_3",
    "words": "坎卦 六四爻辞:樽酒簋贰，用缶，纳约自牖，终无咎。《象》曰：樽酒簋贰，刚柔际也。",
    "name": "坎卦六四爻辞"
  },
  {
    "code": "div010010_2",
    "words": "坎卦 九五爻辞:坎不盈，祗既平，无咎。《象》曰：坎不盈，中未大也。",
    "name": "坎卦九五爻辞"
  },
  {
    "code": "div010010_1",
    "words": "坎卦 上六爻辞:系用徽繹，置于丛棘，三岁不得，凶。《象》曰：上六失道，凶三岁也。",
    "name": "坎卦上六爻辞"
  },
  {
    "code": "div101101_0",
    "words": "离卦 卦辞:利贞，亨。畜牝牛，吉。《象》曰：明两作，离。大人以继明照于四方。",
    "name": "离卦卦辞"
  },
  {
    "code": "div101101_6",
    "words": "离卦 初九爻辞:履错然，敬之无咎。《象》曰：履错之敬，以辟咎也。",
    "name": "离卦初九爻辞"
  },
  {
    "code": "div101101_5",
    "words": "离卦 六二爻辞:黄离，元吉。《象》曰：黄离元吉，得中道也。",
    "name": "离卦六二爻辞"
  },
  {
    "code": "div101101_4",
    "words": "离卦 九三爻辞:日昃之离，不鼓缶而歌，则大耋之嗟，凶。《象》曰：日昃之离，何可久也。",
    "name": "离卦九三爻辞"
  },
  {
    "code": "div101101_3",
    "words": "离卦 九四爻辞:突如其来如，焚如，死如，弃如。《象》曰：突如其来如，无所容也。",
    "name": "离卦九四爻辞"
  },
  {
    "code": "div101101_2",
    "words": "离卦 六五爻辞:出涕沱若，戚嗟若，吉。《象》曰：六五之吉，离王公也。",
    "name": "离卦六五爻辞"
  },
  {
    "code": "div101101_1",
    "words": "离卦 上九爻辞:王用出征，有嘉。折首，获其匪丑，无咎。《象》曰：王用出征，以正邦也。",
    "name": "离卦上九爻辞"
  },
  {
    "code": "div011100_0",
    "words": "咸卦 卦辞:亨，利贞。取女吉。《象》曰：山上有泽，咸。君子以虚受人。",
    "name": "咸卦卦辞"
  },
  {
    "code": "div011100_6",
    "words": "咸卦 初六爻辞:咸其拇。《象》曰：咸其拇，志在外也。",
    "name": "咸卦初六爻辞"
  },
  {
    "code": "div011100_5",
    "words": "咸卦 六二爻辞:咸其腓，凶，居吉。《象》曰：虽凶居吉，顺不害也。",
    "name": "咸卦六二爻辞"
  },
  {
    "code": "div011100_4",
    "words": "咸卦 九三爻辞:咸其股，执其随，往吝。《象》曰：咸其股，亦不处也。志在随人，所执下也。",
    "name": "咸卦九三爻辞"
  },
  {
    "code": "div011100_3",
    "words": "咸卦 九四爻辞:贞吉悔亡，憧憧往来，朋从尔思。《象》曰：贞吉悔亡，未感害也。憧憧往来，未光大也。",
    "name": "咸卦九四爻辞"
  },
  {
    "code": "div011100_2",
    "words": "咸卦 九五爻辞:咸其脢，无悔。《象》曰：咸其脢，志末也。",
    "name": "咸卦九五爻辞"
  },
  {
    "code": "div011100_1",
    "words": "咸卦 上六爻辞:咸其辅，颊，舌。《象》曰：咸其辅，颊，舌，滕口说也。",
    "name": "咸卦上六爻辞"
  },
  {
    "code": "div001110_0",
    "words": "恒卦 卦辞:亨，无咎，利贞。利有攸往。《象》曰：雷风，恒。君子以立不易方。",
    "name": "恒卦卦辞"
  },
  {
    "code": "div001110_6",
    "words": "恒卦 初六爻辞:浚恒，贞凶，无攸利。《象》曰：浚恒之凶，始求深也。",
    "name": "恒卦初六爻辞"
  },
  {
    "code": "div001110_5",
    "words": "恒卦 九二爻辞:悔亡。《象》曰：九二悔亡，能久中也。",
    "name": "恒卦九二爻辞"
  },
  {
    "code": "div001110_4",
    "words": "恒卦 九三爻辞:不恒其德，或承之羞，贞吝。《象》曰：不恒其德，无所容也。",
    "name": "恒卦九三爻辞"
  },
  {
    "code": "div001110_3",
    "words": "恒卦 九四爻辞:田无禽。《象》曰：久非其位，安得禽也？",
    "name": "恒卦九四爻辞"
  },
  {
    "code": "div001110_2",
    "words": "恒卦 六五爻辞:恒其德，贞。妇人吉，夫子凶。《象》曰：妇人贞吉，从一而终也。夫子制义，从妇凶也。",
    "name": "恒卦六五爻辞"
  },
  {
    "code": "div001110_1",
    "words": "恒卦 上六爻辞:振恒，凶。《象》曰：振恒在上，大无功也。",
    "name": "恒卦上六爻辞"
  },
  {
    "code": "div111100_0",
    "words": "遁卦 卦辞:亨。小利贞。《象》曰：天下有山，遁。君子以远小人，不恶而严。",
    "name": "遁卦卦辞"
  },
  {
    "code": "div111100_6",
    "words": "遁卦 初六爻辞:遁尾，厉。勿用有攸往。《象》曰：遁尾之厉，不往何灾也。",
    "name": "遁卦初六爻辞"
  },
  {
    "code": "div111100_5",
    "words": "遁卦 六二爻辞:执之用黄牛之革，莫之胜说。《象》曰：执用黄牛，固志也。",
    "name": "遁卦六二爻辞"
  },
  {
    "code": "div111100_4",
    "words": "遁卦 九三爻辞:系遁，有疾厉，畜臣妾，吉。《象》曰：系遁之厉，有疾惫也。畜臣妾吉，不可大事也。",
    "name": "遁卦九三爻辞"
  },
  {
    "code": "div111100_3",
    "words": "遁卦 九四爻辞:好遁。君子吉，小人否。《象》曰：君子好遁，小人否也。",
    "name": "遁卦九四爻辞"
  },
  {
    "code": "div111100_2",
    "words": "遁卦 九五爻辞:嘉遁，贞吉。《象》曰：嘉遁贞吉，以正志也。",
    "name": "遁卦九五爻辞"
  },
  {
    "code": "div111100_1",
    "words": "遁卦 上九爻辞:肥遁，无不利。《象》曰：肥遁，无不利，无所疑也。",
    "name": "遁卦上九爻辞"
  },
  {
    "code": "div001111_0",
    "words": "大壮卦 卦辞:利贞。《象》曰：雷在天上，大壮。君子以非礼弗履。",
    "name": "大壮卦卦辞"
  },
  {
    "code": "div001111_6",
    "words": "大壮卦 初九爻辞:壮于趾，征凶，有孚。《象》曰：壮于趾，其孚穷也。",
    "name": "大壮卦初九爻辞"
  },
  {
    "code": "div001111_5",
    "words": "大壮卦 九二爻辞:贞吉。《象》曰：九二贞吉，以中也。",
    "name": "大壮卦九二爻辞"
  },
  {
    "code": "div001111_4",
    "words": "大壮卦 九三爻辞:小人用壮，君子用罔，贞厉。羝羊触藩，羸其角。《象》曰：小人用壮，君子罔也。",
    "name": "大壮卦九三爻辞"
  },
  {
    "code": "div001111_3",
    "words": "大壮卦 九四爻辞:贞吉悔亡，藩决不羸，壮于大舆之輹。《象》曰：藩决不羸，尚往也。",
    "name": "大壮卦九四爻辞"
  },
  {
    "code": "div001111_2",
    "words": "大壮卦 六五爻辞:丧羊于易，无悔。《象》曰：丧羊于易，位不当也。",
    "name": "大壮卦六五爻辞"
  },
  {
    "code": "div001111_1",
    "words": "大壮卦 上六爻辞:羝羊触藩，不能退，不能遂，无攸利，艰则吉。《象》曰：不能退，不能遂，不祥也。艰则吉，咎不长也。",
    "name": "大壮卦上六爻辞"
  },
  {
    "code": "div101000_0",
    "words": "晋卦 卦辞:康侯用锡马蕃庶，昼日三接。《象》曰：明出地上，晋。君子以自昭明德。",
    "name": "晋卦卦辞"
  },
  {
    "code": "div101000_6",
    "words": "晋卦 初六爻辞:晋如，摧如，贞吉。罔孚，裕无咎。《象》曰：晋如摧如，独行正也。裕无咎，未受命也。",
    "name": "晋卦初六爻辞"
  },
  {
    "code": "div101000_5",
    "words": "晋卦 六二爻辞:晋如，愁如，贞吉。受兹介福，于其王母。《象》曰：受兹介福，以中正也。",
    "name": "晋卦六二爻辞"
  },
  {
    "code": "div101000_4",
    "words": "晋卦 六三爻辞:众允，悔亡。《象》曰：众允之志，上行也。",
    "name": "晋卦六三爻辞"
  },
  {
    "code": "div101000_3",
    "words": "晋卦 九四爻辞:晋如硕鼠，贞厉。《象》曰：硕鼠贞厉，位不当也。",
    "name": "晋卦九四爻辞"
  },
  {
    "code": "div101000_2",
    "words": "晋卦 六五爻辞:悔亡，失得勿恤，往吉，无不利。《象》曰：失得勿恤，往有庆也。",
    "name": "晋卦六五爻辞"
  },
  {
    "code": "div101000_1",
    "words": "晋卦 上九爻辞:晋其角，维用伐邑。厉吉无咎，贞吝。《象》曰：维用伐邑，道未光也。",
    "name": "晋卦上九爻辞"
  },
  {
    "code": "div000101_0",
    "words": "明夷卦 卦辞:利艰贞。《象》曰：明入地中，明夷。君子以莅众用晦而明。",
    "name": "明夷卦卦辞"
  },
  {
    "code": "div000101_6",
    "words": "明夷卦 初九爻辞:明夷于飞，垂其翼。君子于行，三日不食。有攸往，主人有言。《象》曰：君子于行，义不食也。",
    "name": "明夷卦初九爻辞"
  },
  {
    "code": "div000101_5",
    "words": "明夷卦 六二爻辞:明夷，夷于左股，用拯马壮，吉。《象》曰：六二之吉，顺以则也。",
    "name": "明夷卦六二爻辞"
  },
  {
    "code": "div000101_4",
    "words": "明夷卦 九三爻辞:明夷于南狩，得其大首，不可疾，贞。《象》曰：南狩之志，乃大得也。",
    "name": "明夷卦九三爻辞"
  },
  {
    "code": "div000101_3",
    "words": "明夷卦 六四爻辞:入于左腹，获明夷之心，于出门庭。《象》曰：入于左腹，获心意也。",
    "name": "明夷卦六四爻辞"
  },
  {
    "code": "div000101_2",
    "words": "明夷卦 六五爻辞:箕子之明夷，利贞。《象》曰：箕子之贞，明不可息也。",
    "name": "明夷卦六五爻辞"
  },
  {
    "code": "div000101_1",
    "words": "明夷卦 上六爻辞:不明，晦。初登于天，后入于地。《象》曰：初登于天，照四国也。后入于地，失则也。",
    "name": "明夷卦上六爻辞"
  },
  {
    "code": "div110101_0",
    "words": "家人卦 卦辞:利女贞。《象》曰：风自火出，家人。君子以言有物而行有恒。",
    "name": "家人卦卦辞"
  },
  {
    "code": "div110101_6",
    "words": "家人卦 初九爻辞:闲有家，悔亡。《象》曰：闲有家，志未变也。",
    "name": "家人卦初九爻辞"
  },
  {
    "code": "div110101_5",
    "words": "家人卦 六二爻辞:无攸遂，在中馈。贞吉《象》曰：六二之吉，顺以巽也。",
    "name": "家人卦六二爻辞"
  },
  {
    "code": "div110101_4",
    "words": "家人卦 九三爻辞:家人嗃嗃，悔厉吉；妇子嘻嘻，终吝。《象》曰：家人嗃嗃，未失也。妇子嘻嘻，失家节也。",
    "name": "家人卦九三爻辞"
  },
  {
    "code": "div110101_3",
    "words": "家人卦 六四爻辞:富家，大吉。《象》曰：富家大吉，顺在位也。",
    "name": "家人卦六四爻辞"
  },
  {
    "code": "div110101_2",
    "words": "家人卦 九五爻辞:王假有家，勿恤，吉。《象》曰：王假有家，交相爱也。",
    "name": "家人卦九五爻辞"
  },
  {
    "code": "div110101_1",
    "words": "家人卦 上九爻辞:有孚威如，终吉。《象》曰：威如之吉，反身之谓也。",
    "name": "家人卦上九爻辞"
  },
  {
    "code": "div101011_0",
    "words": "睽卦 卦辞:小事吉。《象》曰：上火下泽，睽。君子以同而异。",
    "name": "睽卦卦辞"
  },
  {
    "code": "div101011_6",
    "words": "睽卦 初九爻辞:悔亡，丧马勿逐，自复。见恶人，无咎。《象》曰：见恶人，以辟咎也。",
    "name": "睽卦初九爻辞"
  },
  {
    "code": "div101011_5",
    "words": "睽卦 九二爻辞:遇主于巷，无咎。《象》曰：遇主于巷，未失道也。",
    "name": "睽卦九二爻辞"
  },
  {
    "code": "div101011_4",
    "words": "睽卦 六三爻辞:见舆曳，其牛掣，其人天且劓，无初有终。《象》曰：见舆曳，位不当也。无初有终，遇刚也。",
    "name": "睽卦六三爻辞"
  },
  {
    "code": "div101011_3",
    "words": "睽卦 九四爻辞:睽孤，遇元夫。交孚，厉无咎。《象》曰：交孚无咎，志行也。",
    "name": "睽卦九四爻辞"
  },
  {
    "code": "div101011_2",
    "words": "睽卦 六五爻辞:悔亡，厥宗噬肤，往何咎？《象》曰：厥宗噬肤，往有庆也。",
    "name": "睽卦六五爻辞"
  },
  {
    "code": "div101011_1",
    "words": "睽卦 上九爻辞:睽孤，见豕负涂，载鬼一车。先张之弧，后说之弧。匪寇婚媾，往遇雨则吉。《象》曰：遇雨之吉，群疑亡也。",
    "name": "睽卦上九爻辞"
  },
  {
    "code": "div010100_0",
    "words": "蹇卦 卦辞:利西南，不利东北。利见大人，贞吉。《象》曰：山上有水，蹇。君子以反身修德。",
    "name": "蹇卦卦辞"
  },
  {
    "code": "div010100_6",
    "words": "蹇卦 初六爻辞:往蹇来誉。《象》曰：往蹇来誉，宜待也。",
    "name": "蹇卦初六爻辞"
  },
  {
    "code": "div010100_5",
    "words": "蹇卦 六二爻辞:王臣蹇蹇，匪躬之故。《象》曰：王臣蹇蹇，终无尤也。",
    "name": "蹇卦六二爻辞"
  },
  {
    "code": "div010100_4",
    "words": "蹇卦 九三爻辞:往蹇来反。《象》曰：往蹇来反，内喜之也。",
    "name": "蹇卦九三爻辞"
  },
  {
    "code": "div010100_3",
    "words": "蹇卦 六四爻辞:往蹇来连。《象》曰：往蹇来连，当位实也。",
    "name": "蹇卦六四爻辞"
  },
  {
    "code": "div010100_2",
    "words": "蹇卦 九五爻辞:大蹇，朋来。《象》曰：大蹇朋来，以中节也。",
    "name": "蹇卦九五爻辞"
  },
  {
    "code": "div010100_1",
    "words": "蹇卦 上六爻辞:往蹇来硕，吉。利见大人。《象》曰：往蹇来硕，志在内也。利见大人，以从贵也。",
    "name": "蹇卦上六爻辞"
  },
  {
    "code": "div001010_0",
    "words": "解卦 卦辞:利西南，无所往，其来复吉。有攸往，夙吉。《象》曰：雷雨作，解。君子以赦过宥罪。",
    "name": "解卦卦辞"
  },
  {
    "code": "div001010_6",
    "words": "解卦 初六爻辞:无咎。《象》曰：刚柔之际，义无咎也。",
    "name": "解卦初六爻辞"
  },
  {
    "code": "div001010_5",
    "words": "解卦 九二爻辞:田获三狐，得黄矢，贞吉。《象》曰：九二贞吉，得中道也。",
    "name": "解卦九二爻辞"
  },
  {
    "code": "div001010_4",
    "words": "解卦 六三爻辞:负且乘，致寇至，贞吝。《象》曰：负且乘，亦可丑也。自我致戎，又谁咎也。",
    "name": "解卦六三爻辞"
  },
  {
    "code": "div001010_3",
    "words": "解卦 九四爻辞:解而拇，朋至斯孚。《象》曰：解而拇，未当位也。",
    "name": "解卦九四爻辞"
  },
  {
    "code": "div001010_2",
    "words": "解卦 六五爻辞:君子维有解，吉，有孚于小人。《象》曰：君子有解，小人退也。",
    "name": "解卦六五爻辞"
  },
  {
    "code": "div001010_1",
    "words": "解卦 上六爻辞:公用射隼于高墉之上，获之无不利。《象》曰：公用射隼，以解悖也。",
    "name": "解卦上六爻辞"
  },
  {
    "code": "div100011_0",
    "words": "损卦 卦辞:有孚，元吉，无咎，可贞。利有攸往。曷之用？二簋可用享。《象》曰：山下有泽，损。君子以惩忿窒欲。",
    "name": "损卦卦辞"
  },
  {
    "code": "div100011_6",
    "words": "损卦 初九爻辞:已事遄往，无咎。酌损之。《象》曰：已事遄往，尚合志也。",
    "name": "损卦初九爻辞"
  },
  {
    "code": "div100011_5",
    "words": "损卦 九二爻辞:利贞，征凶。弗损，益之。《象》曰：九二利贞，中以为志也。",
    "name": "损卦九二爻辞"
  },
  {
    "code": "div100011_4",
    "words": "损卦 六三爻辞:三人行则损一人，一人行则得其友。《象》曰：一人行，三则疑也。",
    "name": "损卦六三爻辞"
  },
  {
    "code": "div100011_3",
    "words": "损卦 六四爻辞:损其疾，使遄有喜，无咎。《象》曰：损其疾，亦可喜也。",
    "name": "损卦六四爻辞"
  },
  {
    "code": "div100011_2",
    "words": "损卦 六五爻辞:或益之十朋之龟，弗克违。元吉。《象》曰：六五元吉，自上佑也。",
    "name": "损卦六五爻辞"
  },
  {
    "code": "div100011_1",
    "words": "损卦 上九爻辞:弗损，益之，无咎，贞吉，利有攸往，得臣无家。《象》曰：弗损益之，大得志也",
    "name": "损卦上九爻辞"
  },
  {
    "code": "div110001_0",
    "words": "益卦 卦辞:利有攸往，利涉大川。《象》曰：风雷，益。君子以见善则迁，有过则改。",
    "name": "益卦卦辞"
  },
  {
    "code": "div110001_6",
    "words": "益卦 初九爻辞:利用为大作，元吉，无咎。《象》曰：元吉无咎，下不厚事也。",
    "name": "益卦初九爻辞"
  },
  {
    "code": "div110001_5",
    "words": "益卦 六二爻辞:或益之十朋之龟，弗克违。永贞吉。王用享于帝，吉。《象》曰：或益之，自外来也。",
    "name": "益卦六二爻辞"
  },
  {
    "code": "div110001_4",
    "words": "益卦 六三爻辞:益之用凶事，无咎。有孚中行，告公用圭。《象》曰：益用凶事，固有之也。",
    "name": "益卦六三爻辞"
  },
  {
    "code": "div110001_3",
    "words": "益卦 六四爻辞:中行，告公从，利用为依迁国。《象》曰：告公从，以益志也。",
    "name": "益卦六四爻辞"
  },
  {
    "code": "div110001_2",
    "words": "益卦 九五爻辞:有孚惠心，勿问元吉。有孚惠我德。《象》曰：有孚惠心，勿问之矣。惠我德，大得志也。",
    "name": "益卦九五爻辞"
  },
  {
    "code": "div110001_1",
    "words": "益卦 上九爻辞:莫益之，或击之，立心勿恒，凶。《象》曰：莫益之，偏辞也。或击之，自外来也。",
    "name": "益卦上九爻辞"
  },
  {
    "code": "div011111_0",
    "words": "夬卦 卦辞:扬于王庭。孚号有厉。告自邑，不利即戎，利有攸往。《象》曰：泽上于天，夬。君子以施禄及下，居德则忌。",
    "name": "夬卦卦辞"
  },
  {
    "code": "div011111_6",
    "words": "夬卦 初九爻辞:壮于前趾，往不胜为吝。《象》曰：不胜而往，咎也。",
    "name": "夬卦初九爻辞"
  },
  {
    "code": "div011111_5",
    "words": "夬卦 九二爻辞:惕号，莫夜有戎，勿恤。《象》曰：有戎勿恤，得中道也。",
    "name": "夬卦九二爻辞"
  },
  {
    "code": "div011111_4",
    "words": "夬卦 九三爻辞:壮于頄，有凶。君子夬夬独行，遇雨若濡，有愠无咎。《象》曰：君子夬夬，终无咎也。",
    "name": "夬卦九三爻辞"
  },
  {
    "code": "div011111_3",
    "words": "夬卦 九四爻辞:臀无肤，其行次且。牵羊悔亡，闻言不信。《象》曰：其行次且，位不当也。闻言不信，聪不明也。",
    "name": "夬卦九四爻辞"
  },
  {
    "code": "div011111_2",
    "words": "夬卦 九五爻辞:苋陆夬夬，中行无咎。《象》曰：中行无咎，中未光也。",
    "name": "夬卦九五爻辞"
  },
  {
    "code": "div011111_1",
    "words": "夬卦 上六爻辞:无号，终有凶。《象》曰：无号之凶，终不可长也。",
    "name": "夬卦上六爻辞"
  },
  {
    "code": "div111110_0",
    "words": "姤卦 卦辞:女壮，勿用取女。《象》曰：天下有风，姤；后以施命诰四方。",
    "name": "姤卦卦辞"
  },
  {
    "code": "div111110_6",
    "words": "姤卦 初六爻辞:系于金柅，贞吉。有攸往，见凶，羸豕踟躅。《象》曰：系于金柅，柔道牵也。",
    "name": "姤卦初六爻辞"
  },
  {
    "code": "div111110_5",
    "words": "姤卦 九二爻辞:包有鱼，无咎，不利宾。《象》曰：包有鱼，义不及宾也。",
    "name": "姤卦九二爻辞"
  },
  {
    "code": "div111110_4",
    "words": "姤卦 九三爻辞:臀无肤，其行次且，厉，无大咎。《象》曰：其行次且，行未牵也。",
    "name": "姤卦九三爻辞"
  },
  {
    "code": "div111110_3",
    "words": "姤卦 九四爻辞:包无鱼，起凶。《象》曰：无鱼之凶，远民也。",
    "name": "姤卦九四爻辞"
  },
  {
    "code": "div111110_2",
    "words": "姤卦 九五爻辞:以杞包瓜，含章，有陨自天。《象》曰：九五含章，中正也。有陨自天，志不舍命也。",
    "name": "姤卦九五爻辞"
  },
  {
    "code": "div111110_1",
    "words": "姤卦 上九爻辞:姤其角，吝，无咎。《象》曰：姤其角，上穷吝也。",
    "name": "姤卦上九爻辞"
  },
  {
    "code": "div011000_0",
    "words": "萃卦 卦辞:亨。王假有庙。利见大人，亨，利贞。用大牲吉，利有攸往。《象》曰：泽上于地，萃。君子以除戎器，戒不虞。",
    "name": "萃卦卦辞"
  },
  {
    "code": "div011000_6",
    "words": "萃卦 初六爻辞:有孚不终，乃乱乃萃。若号，一握为笑。勿恤，往无咎。《象》曰：乃乱乃萃，其志乱也。",
    "name": "萃卦初六爻辞"
  },
  {
    "code": "div011000_5",
    "words": "萃卦 六二爻辞:引吉，无咎，孚乃利用禴。《象》曰：引吉无咎，中未变也。",
    "name": "萃卦六二爻辞"
  },
  {
    "code": "div011000_4",
    "words": "萃卦 六三爻辞:萃如，嗟如，无攸利。往无咎，小吝。《象》曰：往无咎，上巽也。",
    "name": "萃卦六三爻辞"
  },
  {
    "code": "div011000_3",
    "words": "萃卦 九四爻辞:大吉，无咎。《象》曰：大吉无咎，位不当也。",
    "name": "萃卦九四爻辞"
  },
  {
    "code": "div011000_2",
    "words": "萃卦 九五爻辞:萃有位，无咎。匪孚，元永贞，悔亡。《象》曰：萃有位，志未光也。",
    "name": "萃卦九五爻辞"
  },
  {
    "code": "div011000_1",
    "words": "萃卦 上六爻辞:赍咨涕洟，无咎。《象》曰：赍咨涕洟，未安上也。",
    "name": "萃卦上六爻辞"
  },
  {
    "code": "div000110_0",
    "words": "升卦 卦辞:元亨，用见大人，勿恤，南征吉。《象》曰：地中生木，升。君子以顺德，积小以高大。",
    "name": "升卦卦辞"
  },
  {
    "code": "div000110_6",
    "words": "升卦 初六爻辞:允升，大吉。《象》曰：允升大吉，上合志也。",
    "name": "升卦初六爻辞"
  },
  {
    "code": "div000110_5",
    "words": "升卦 九二爻辞:孚乃利用禴，无咎。《象》曰：九二之孚，有喜也。",
    "name": "升卦九二爻辞"
  },
  {
    "code": "div000110_4",
    "words": "升卦 九三爻辞:升虚邑。《象》曰：升虚邑，无所疑也。",
    "name": "升卦九三爻辞"
  },
  {
    "code": "div000110_3",
    "words": "升卦 六四爻辞:王用亨于岐山，吉，无咎。《象》曰：王用亨于岐山，顺事也。",
    "name": "升卦六四爻辞"
  },
  {
    "code": "div000110_2",
    "words": "升卦 六五爻辞:贞吉，升阶。《象》曰：贞吉升阶，大得志也。",
    "name": "升卦六五爻辞"
  },
  {
    "code": "div000110_1",
    "words": "升卦 上六爻辞:冥升，利于不息之贞。《象》曰：冥升在上，消不富也。",
    "name": "升卦上六爻辞"
  },
  {
    "code": "div011010_0",
    "words": "困卦 卦辞:亨，贞，大人吉，无咎。有言不信。《象》曰：泽无水，困。君子以致命遂志。",
    "name": "困卦卦辞"
  },
  {
    "code": "div011010_6",
    "words": "困卦 初六爻辞:臀困于株木，入于幽谷，三岁不觌。《象》曰：入于幽谷，幽不明也。",
    "name": "困卦初六爻辞"
  },
  {
    "code": "div011010_5",
    "words": "困卦 九二爻辞:困于酒食，朱绂方来，利用亨祀。征凶，无咎。《象》曰：困于酒食，中有庆也。",
    "name": "困卦九二爻辞"
  },
  {
    "code": "div011010_4",
    "words": "困卦 六三爻辞:困于石，据于蒺藜，入于其宫，不见其妻，凶。《象》曰：据于蒺藜，乘刚也。入于其宫，不见其妻，不祥也。",
    "name": "困卦六三爻辞"
  },
  {
    "code": "div011010_3",
    "words": "困卦 九四爻辞:来徐徐，困于金车，吝，有终。《象》曰：来徐徐，志在下也。虽不当位，有与也。",
    "name": "困卦九四爻辞"
  },
  {
    "code": "div011010_2",
    "words": "困卦 九五爻辞:劓刖，困于赤绂，乃徐有说，利用祭祀。《象》曰：劓刖，志未得也。乃徐有说，以中直也。利用祭祀，受福也。",
    "name": "困卦九五爻辞"
  },
  {
    "code": "div011010_1",
    "words": "困卦 上六爻辞:困于葛藟，于臲卼，曰动悔。有悔，征吉。《象》曰：困于葛藟，未当也。动悔有悔，吉行也。",
    "name": "困卦上六爻辞"
  },
  {
    "code": "div010110_0",
    "words": "井卦 卦辞:改邑不改井，无丧无得。往来井井。汔至亦未繘井，羸其瓶，凶。《象》曰：木上有水，井。君子以劳民劝相。",
    "name": "井卦卦辞"
  },
  {
    "code": "div010110_6",
    "words": "井卦 初六爻辞:井泥不食，旧井无禽。《象》曰：井泥不食，下也。旧井无禽，时舍也。",
    "name": "井卦初六爻辞"
  },
  {
    "code": "div010110_5",
    "words": "井卦 九二爻辞:井谷射鲋，瓮敝漏。《象》曰：井谷射鲋，无与也。",
    "name": "井卦九二爻辞"
  },
  {
    "code": "div010110_4",
    "words": "井卦 九三爻辞:井渫不食，为我心恻。可用汲，王明，并受其福。《象》曰：井渫不食，行恻也。求王明，受福也。",
    "name": "井卦九三爻辞"
  },
  {
    "code": "div010110_3",
    "words": "井卦 六四爻辞:井甃，无咎。《象》曰：井甃无咎，修井也。",
    "name": "井卦六四爻辞"
  },
  {
    "code": "div010110_2",
    "words": "井卦 九五爻辞:井冽寒泉，食。《象》曰：寒泉之食，中正也。",
    "name": "井卦九五爻辞"
  },
  {
    "code": "div010110_1",
    "words": "井卦 上六爻辞:井收勿幕，有孚元吉。《象》曰：元吉在上，大成也。",
    "name": "井卦上六爻辞"
  },
  {
    "code": "div011101_0",
    "words": "革卦 卦辞:己日乃孚。元亨利贞。悔亡。《象》曰：泽中有火，革。君子以治历明时。",
    "name": "革卦卦辞"
  },
  {
    "code": "div011101_6",
    "words": "革卦 初九爻辞:巩用黄牛之革。《象》曰：巩用黄牛，不可以有为也。",
    "name": "革卦初九爻辞"
  },
  {
    "code": "div011101_5",
    "words": "革卦 六二爻辞:己日乃革之，征吉，无咎。《象》曰：己日革之，行有嘉也。",
    "name": "革卦六二爻辞"
  },
  {
    "code": "div011101_4",
    "words": "革卦 九三爻辞:征凶贞厉。革言三就，有孚。《象》曰：革言三就，又何之矣。",
    "name": "革卦九三爻辞"
  },
  {
    "code": "div011101_3",
    "words": "革卦 九四爻辞:悔亡，有孚，改命，吉。《象》曰：改命之吉，信志也。",
    "name": "革卦九四爻辞"
  },
  {
    "code": "div011101_2",
    "words": "革卦 九五爻辞:大人虎变，未占有孚。《象》曰：大人虎变，其文炳也。",
    "name": "革卦九五爻辞"
  },
  {
    "code": "div011101_1",
    "words": "革卦 上六爻辞:君子豹变，小人革面，征凶，居贞吉。《象》曰：君子豹变，其文蔚也。小人革面，顺以从君也。",
    "name": "革卦上六爻辞"
  },
  {
    "code": "div101110_0",
    "words": "鼎卦 卦辞:元吉，亨。《象》曰：木上有火，鼎。君子以正位凝命。",
    "name": "鼎卦卦辞"
  },
  {
    "code": "div101110_6",
    "words": "鼎卦 初六爻辞:鼎颠趾，利出否。得妾以其子，无咎。《象》曰：鼎颠趾，未悖也。利出否，以从贵也。",
    "name": "鼎卦初六爻辞"
  },
  {
    "code": "div101110_5",
    "words": "鼎卦 九二爻辞:鼎有实，我仇有疾，不我能即，吉。《象》曰：鼎有实，慎所之也。我仇有疾，终无尤也。",
    "name": "鼎卦九二爻辞"
  },
  {
    "code": "div101110_4",
    "words": "鼎卦 九三爻辞:鼎耳革，其行塞，雉膏不食。方雨，亏悔，终吉。《象》曰：鼎耳革，失其义也。",
    "name": "鼎卦九三爻辞"
  },
  {
    "code": "div101110_3",
    "words": "鼎卦 九四爻辞:鼎折足，覆公餗，其形渥，凶。《象》曰：覆公餗，信如何也？",
    "name": "鼎卦九四爻辞"
  },
  {
    "code": "div101110_2",
    "words": "鼎卦 六五爻辞:鼎黄耳金铉，利贞。《象》曰：鼎黄耳，中以为实也。",
    "name": "鼎卦六五爻辞"
  },
  {
    "code": "div101110_1",
    "words": "鼎卦 上九爻辞:鼎玉铉，大吉，无不利。《象》曰：玉铉在上，刚柔节也。",
    "name": "鼎卦上九爻辞"
  },
  {
    "code": "div001001_0",
    "words": "震卦 卦辞:亨。震来虩虩，笑言哑哑。震惊百里，不丧匕鬯。《象》曰：洊雷，震。君子以恐惧修身。",
    "name": "震卦卦辞"
  },
  {
    "code": "div001001_6",
    "words": "震卦 初九爻辞:震来虩虩，后笑言哑哑，吉。《象》曰：震来虩虩，恐致福也。笑言哑哑，后有则也。",
    "name": "震卦初九爻辞"
  },
  {
    "code": "div001001_5",
    "words": "震卦 六二爻辞:震来厉，亿丧贝，跻于九陵，勿逐，七日得。《象》曰：震来厉，乘刚也。",
    "name": "震卦六二爻辞"
  },
  {
    "code": "div001001_4",
    "words": "震卦 六三爻辞:震苏苏，震行无眚。《象》曰：震苏苏，位不当也。",
    "name": "震卦六三爻辞"
  },
  {
    "code": "div001001_3",
    "words": "震卦 九四爻辞:震遂泥。《象》曰：震遂泥，未光也。",
    "name": "震卦九四爻辞"
  },
  {
    "code": "div001001_2",
    "words": "震卦 六五爻辞:震往来厉，亿无丧，有事。《象》曰：震往来厉，危行也。其事在中，大无丧也。",
    "name": "震卦六五爻辞"
  },
  {
    "code": "div001001_1",
    "words": "震卦 上六爻辞:震索索，视矍矍，征凶。震不于其躬，于其邻，无咎。婚媾有言。《象》曰：震索索，未得中也。虽凶无咎，畏邻戒也。",
    "name": "震卦上六爻辞"
  },
  {
    "code": "div100100_0",
    "words": "艮卦 卦辞:艮其背，不获其身，行其庭，不见其人，无咎。《象》曰：兼山，艮；君子以思不出其位。",
    "name": "艮卦卦辞"
  },
  {
    "code": "div100100_6",
    "words": "艮卦 初六爻辞:艮其趾，无咎。利永贞。《象》曰：艮其趾，未失正也。",
    "name": "艮卦初六爻辞"
  },
  {
    "code": "div100100_5",
    "words": "艮卦 六二爻辞:艮其腓，不拯其随，其心不快。《象》曰：不拯其随，未退听也。",
    "name": "艮卦六二爻辞"
  },
  {
    "code": "div100100_4",
    "words": "艮卦 九三爻辞:艮其限，列其夤，厉薰心。《象》曰：艮其限，危薰心也。",
    "name": "艮卦九三爻辞"
  },
  {
    "code": "div100100_3",
    "words": "艮卦 六四爻辞:艮其身，无咎。《象》曰：艮其身，止诸躬也。",
    "name": "艮卦六四爻辞"
  },
  {
    "code": "div100100_2",
    "words": "艮卦 六五爻辞:艮其辅，言有序，悔亡。《象》曰：艮其辅，以中正也。",
    "name": "艮卦六五爻辞"
  },
  {
    "code": "div100100_1",
    "words": "艮卦 上九爻辞:敦艮，吉。《象》曰：敦艮之吉，以厚终也。",
    "name": "艮卦上九爻辞"
  },
  {
    "code": "div110100_0",
    "words": "渐卦 卦辞:女归吉，利贞。《象》曰：山上有木，渐。君子以居贤德善俗。",
    "name": "渐卦卦辞"
  },
  {
    "code": "div110100_6",
    "words": "渐卦 初六爻辞:鸿渐于干，小子厉，有言，无咎。《象》曰：小子之厉，义无咎也。",
    "name": "渐卦初六爻辞"
  },
  {
    "code": "div110100_5",
    "words": "渐卦 六二爻辞:鸿渐于磐，饮食衍衍，吉。《象》曰：饮食衍衍，不素饱也。",
    "name": "渐卦六二爻辞"
  },
  {
    "code": "div110100_4",
    "words": "渐卦 九三爻辞:鸿渐于陆。夫征不复，妇孕不育，凶。利御寇。《象》曰：夫征不复，离群丑也。妇孕不育，失其道也。利用御寇，顺相保也。",
    "name": "渐卦九三爻辞"
  },
  {
    "code": "div110100_3",
    "words": "渐卦 六四爻辞:鸿渐于木，或得其桷，无咎。《象》曰：或得其桷，顺以巽也。",
    "name": "渐卦六四爻辞"
  },
  {
    "code": "div110100_2",
    "words": "渐卦 九五爻辞:鸿渐于陵，妇三岁不孕，终莫之胜，吉。《象》曰：终莫之胜，吉，得所愿也。",
    "name": "渐卦九五爻辞"
  },
  {
    "code": "div110100_1",
    "words": "渐卦 上九爻辞:鸿渐于逵，其羽可用为仪，吉。《象》曰：其羽可用为仪吉，不可乱也。",
    "name": "渐卦上九爻辞"
  },
  {
    "code": "div001011_0",
    "words": "归妹卦 卦辞:征凶，无攸利。《象》曰：泽上有雷，归妹。君子以永终知敝。",
    "name": "归妹卦卦辞"
  },
  {
    "code": "div001011_6",
    "words": "归妹卦 初九爻辞:归妹以娣，跛能履，征吉。《象》曰：归妹以娣，以恒也。跛能履，吉相承也。",
    "name": "归妹卦初九爻辞"
  },
  {
    "code": "div001011_5",
    "words": "归妹卦 九二爻辞:眇能视，利幽人之贞。《象》曰：利幽人之贞，未变常也。",
    "name": "归妹卦九二爻辞"
  },
  {
    "code": "div001011_4",
    "words": "归妹卦 六三爻辞:归妹以须，反归以娣。《象》曰：归妹以须，未当也。",
    "name": "归妹卦六三爻辞"
  },
  {
    "code": "div001011_3",
    "words": "归妹卦 九四爻辞:归妹愆期，迟归有时。《象》曰：愆期之志，有待而行也。",
    "name": "归妹卦九四爻辞"
  },
  {
    "code": "div001011_2",
    "words": "归妹卦 六五爻辞:帝乙归妹，其君之袂不如其娣之袂良，月几望，吉。《象》曰：帝乙归妹，不如其娣之袂良也。其位在中，以贵行也。",
    "name": "归妹卦六五爻辞"
  },
  {
    "code": "div001011_1",
    "words": "归妹卦 上六爻辞:女承筐无实，士刲羊无血，无攸利。《象》曰：上六无实，承虚筐也。",
    "name": "归妹卦上六爻辞"
  },
  {
    "code": "div001101_0",
    "words": "丰卦 卦辞:亨。王假之，勿忧，宜日中。《象》曰：雷电皆至，丰。君子以折狱致刑。",
    "name": "丰卦卦辞"
  },
  {
    "code": "div001101_6",
    "words": "丰卦 初九爻辞:遇其配主，虽旬无咎，往有尚。《象》曰：虽旬无咎，过旬灾也。",
    "name": "丰卦初九爻辞"
  },
  {
    "code": "div001101_5",
    "words": "丰卦 六二爻辞:丰其蔀，日中见斗。往得疑疾，有孚发若，吉。《象》曰：有孚发若，信以发志也。",
    "name": "丰卦六二爻辞"
  },
  {
    "code": "div001101_4",
    "words": "丰卦 九三爻辞:丰其沛，日中见昧，折其右肱，无咎。《象》曰：丰其沛，不可大事也。折其右肱，终不可用也。",
    "name": "丰卦九三爻辞"
  },
  {
    "code": "div001101_3",
    "words": "丰卦 九四爻辞:丰其蔀，日中见斗，遇其夷主，吉。《象》曰：丰其蔀，位不当也。日中见斗，幽不明也。遇其夷主，吉行也。",
    "name": "丰卦九四爻辞"
  },
  {
    "code": "div001101_2",
    "words": "丰卦 六五爻辞:来章，有庆誉，吉。《象》曰：六五之吉，有庆也。",
    "name": "丰卦六五爻辞"
  },
  {
    "code": "div001101_1",
    "words": "丰卦 上六爻辞:丰其屋，蔀其家，窥其户，阒其无人，三岁不觌，凶。《象》曰：丰其屋，天际翔也。窥其户，阒其无人，自藏也。",
    "name": "丰卦上六爻辞"
  },
  {
    "code": "div101100_0",
    "words": "旅卦 卦辞:小亨，旅贞吉。《象》曰：山上有火，旅。君子以明慎用刑而不留狱。",
    "name": "旅卦卦辞"
  },
  {
    "code": "div101100_6",
    "words": "旅卦 初六爻辞:旅琐琐，斯其所取灾。《象》曰：旅琐琐，志穷灾也。",
    "name": "旅卦初六爻辞"
  },
  {
    "code": "div101100_5",
    "words": "旅卦 六二爻辞:旅即次，怀其资，得童仆，贞。《象》曰：得童仆贞，终无尤也。",
    "name": "旅卦六二爻辞"
  },
  {
    "code": "div101100_4",
    "words": "旅卦 九三爻辞:旅焚其次，丧其童仆，贞厉。《象》曰：旅焚其次，亦以伤矣。以旅与下，其义丧也。",
    "name": "旅卦九三爻辞"
  },
  {
    "code": "div101100_3",
    "words": "旅卦 九四爻辞:旅于处，得其资斧，我心不快。《象》曰：旅于处，未得位也。得其资斧，心未快也。",
    "name": "旅卦九四爻辞"
  },
  {
    "code": "div101100_2",
    "words": "旅卦 六五爻辞:射雉，一矢亡，终以誉命。《象》曰：终以誉命，上逮也。",
    "name": "旅卦六五爻辞"
  },
  {
    "code": "div101100_1",
    "words": "旅卦 上九爻辞:鸟焚其巢，旅人先笑后号咷。丧牛于易，凶。《象》曰：以旅在上，其义焚也。丧牛于易，终莫之闻也。",
    "name": "旅卦上九爻辞"
  },
  {
    "code": "div110110_0",
    "words": "巽卦 卦辞:小亨。利有攸往，利见大人。《象》曰：随风，巽。君子以申命行事。",
    "name": "巽卦卦辞"
  },
  {
    "code": "div110110_6",
    "words": "巽卦 初六爻辞:进退，利武人之贞。《象》曰：进退，志疑也。利武人之贞，志治也。",
    "name": "巽卦初六爻辞"
  },
  {
    "code": "div110110_5",
    "words": "巽卦 九二爻辞:巽在床下，用史巫纷若，吉，无咎。《象》曰：纷若之吉，得中也。",
    "name": "巽卦九二爻辞"
  },
  {
    "code": "div110110_4",
    "words": "巽卦 九三爻辞:频巽，吝。《象》曰：频巽之吝，志穷也。",
    "name": "巽卦九三爻辞"
  },
  {
    "code": "div110110_3",
    "words": "巽卦 六四爻辞:悔亡，田获三品。《象》曰：田获三品，有功也。",
    "name": "巽卦六四爻辞"
  },
  {
    "code": "div110110_2",
    "words": "巽卦 九五爻辞:贞吉，悔亡，无不利。无初有终。先庚三日，后庚三日，吉。《象》曰：九五之吉，位正中也。",
    "name": "巽卦九五爻辞"
  },
  {
    "code": "div110110_1",
    "words": "巽卦 上九爻辞:巽在床下，丧其资斧，贞凶。《象》曰：巽在床下，上穷也。丧其资斧，正乎凶也。",
    "name": "巽卦上九爻辞"
  },
  {
    "code": "div011011_0",
    "words": "兑卦 卦辞:亨，利贞。《象》曰：丽泽，兑。君子以朋友讲习。",
    "name": "兑卦卦辞"
  },
  {
    "code": "div011011_6",
    "words": "兑卦 初九爻辞:和兑，吉。《象》曰：和兑之吉，行未疑也。",
    "name": "兑卦初九爻辞"
  },
  {
    "code": "div011011_5",
    "words": "兑卦 九二爻辞:孚兑，吉，悔亡。《象》曰：孚兑之吉，信志也。",
    "name": "兑卦九二爻辞"
  },
  {
    "code": "div011011_4",
    "words": "兑卦 六三爻辞:来兑，凶。《象》曰：来兑之凶，位不当也。",
    "name": "兑卦六三爻辞"
  },
  {
    "code": "div011011_3",
    "words": "兑卦 九四爻辞:商未宁，介疾有喜。《象》曰：九四之喜，有庆也。",
    "name": "兑卦九四爻辞"
  },
  {
    "code": "div011011_2",
    "words": "兑卦 九五爻辞:孚于剥，有厉。《象》曰：孚于剥，位正当也。",
    "name": "兑卦九五爻辞"
  },
  {
    "code": "div011011_1",
    "words": "兑卦 上六爻辞:引兑。《象》曰：上六引兑，未光也。",
    "name": "兑卦上六爻辞"
  },
  {
    "code": "div110010_0",
    "words": "涣卦 卦辞:亨。王假有庙。利涉大川，利贞。《象》曰：风行水上，涣。先王以享于帝，立庙。",
    "name": "涣卦卦辞"
  },
  {
    "code": "div110010_6",
    "words": "涣卦 初六爻辞:用拯马壮，吉。《象》曰：初六之吉，顺也。",
    "name": "涣卦初六爻辞"
  },
  {
    "code": "div110010_5",
    "words": "涣卦 九二爻辞:涣奔其机，悔亡。《象》曰：涣奔其机，得愿也。",
    "name": "涣卦九二爻辞"
  },
  {
    "code": "div110010_4",
    "words": "涣卦 六三爻辞:涣其躬，无悔。《象》曰：涣其躬，志在外也。",
    "name": "涣卦六三爻辞"
  },
  {
    "code": "div110010_3",
    "words": "涣卦 六四爻辞:涣其群，元吉。涣有丘，匪夷所思。《象》曰：涣其群，元吉，光大也。",
    "name": "涣卦六四爻辞"
  },
  {
    "code": "div110010_2",
    "words": "涣卦 九五爻辞:涣汗，其大号涣，王居，无咎。《象》曰：王居无咎，正位也。",
    "name": "涣卦九五爻辞"
  },
  {
    "code": "div110010_1",
    "words": "涣卦 上九爻辞:涣其血，去逖出，无咎。《象》曰：涣其血，远害也。",
    "name": "涣卦上九爻辞"
  },
  {
    "code": "div010011_0",
    "words": "节卦 卦辞:亨。苦节不可贞。《象》曰：泽上有水，节。君子以制数度，议德行。",
    "name": "节卦卦辞"
  },
  {
    "code": "div010011_6",
    "words": "节卦 初九爻辞:不出户庭，无咎。《象》曰：不出户庭，知通塞也。",
    "name": "节卦初九爻辞"
  },
  {
    "code": "div010011_5",
    "words": "节卦 九二爻辞:不出门庭，凶。《象》曰：不出门庭凶，失时极也。",
    "name": "节卦九二爻辞"
  },
  {
    "code": "div010011_4",
    "words": "节卦 六三爻辞:不节若，则嗟若，无咎。《象》曰：不节之嗟，又谁咎也？",
    "name": "节卦六三爻辞"
  },
  {
    "code": "div010011_3",
    "words": "节卦 六四爻辞:安节，亨。《象》曰：安节之亨，承上道也。",
    "name": "节卦六四爻辞"
  },
  {
    "code": "div010011_2",
    "words": "节卦 九五爻辞:甘节，吉，往有尚。《象》曰：甘节之吉，居位中也。",
    "name": "节卦九五爻辞"
  },
  {
    "code": "div010011_1",
    "words": "节卦 上六爻辞:苦节，贞凶，悔亡。《象》曰：苦节贞凶，其道穷也。",
    "name": "节卦上六爻辞"
  },
  {
    "code": "div110011_0",
    "words": "中孚卦 卦辞:豚鱼，吉，利涉大川，利贞。《象》曰：泽上有风，中孚。君子以议狱缓死。",
    "name": "中孚卦卦辞"
  },
  {
    "code": "div110011_6",
    "words": "中孚卦 初九爻辞:虞吉，有它不燕。《象》曰：初九虞吉，志未变也。",
    "name": "中孚卦初九爻辞"
  },
  {
    "code": "div110011_5",
    "words": "中孚卦 九二爻辞:鸣鹤在阴，其子和之。我有好爵，吾与尔靡之。《象》曰：其子和之，中心愿也。",
    "name": "中孚卦九二爻辞"
  },
  {
    "code": "div110011_4",
    "words": "中孚卦 六三爻辞:得敌，或鼓或罢，或泣或歌。《象》曰：可鼓或罢，位不当也。",
    "name": "中孚卦六三爻辞"
  },
  {
    "code": "div110011_3",
    "words": "中孚卦 六四爻辞:月几望，马匹亡，无咎。《象》曰：马匹亡，绝类上也。",
    "name": "中孚卦六四爻辞"
  },
  {
    "code": "div110011_2",
    "words": "中孚卦 九五爻辞:有孚挛如，无咎。《象》曰：有孚挛如，位正当也。",
    "name": "中孚卦九五爻辞"
  },
  {
    "code": "div110011_1",
    "words": "中孚卦 上九爻辞:翰音登于天，贞凶。《象》曰：翰音登于天，何可长也。",
    "name": "中孚卦上九爻辞"
  },
  {
    "code": "div001100_0",
    "words": "小过卦 卦辞:亨，利贞。可小事，不可大事。飞鸟遗之音。不宜上，宜下，大吉。《象》曰：山上有雷，小过；君子以行过乎恭，丧过乎哀，用过乎俭。",
    "name": "小过卦卦辞"
  },
  {
    "code": "div001100_6",
    "words": "小过卦 初六爻辞:飞鸟以凶。《象》曰：飞鸟以凶，不可如何也。",
    "name": "小过卦初六爻辞"
  },
  {
    "code": "div001100_5",
    "words": "小过卦 六二爻辞:过其祖，遇其妣。不及其君，遇其臣。无咎。《象》曰：不及其君，臣不可过也。",
    "name": "小过卦六二爻辞"
  },
  {
    "code": "div001100_4",
    "words": "小过卦 九三爻辞:弗过防之，从或戕之，凶。《象》曰：从或戕之，凶如何也。",
    "name": "小过卦九三爻辞"
  },
  {
    "code": "div001100_3",
    "words": "小过卦 九四爻辞:无咎。弗过遇之，往厉必戒，勿用永贞。《象》曰：弗过遇之，位不当也。往厉必戒，终不可长也。",
    "name": "小过卦九四爻辞"
  },
  {
    "code": "div001100_2",
    "words": "小过卦 六五爻辞:密云不雨，自我西郊。公弋取彼在穴。《象》曰：密云不雨，已上也。",
    "name": "小过卦六五爻辞"
  },
  {
    "code": "div001100_1",
    "words": "小过卦 上六爻辞:弗遇过之，飞鸟离之，凶，是谓灾眚。《象》曰：弗遇过之，已亢也。",
    "name": "小过卦上六爻辞"
  },
  {
    "code": "div010101_0",
    "words": "既济卦 卦辞:亨小，利贞。初吉终乱。《象》曰：水在火上，既济。君子以思患而预防之。",
    "name": "既济卦卦辞"
  },
  {
    "code": "div010101_6",
    "words": "既济卦 初九爻辞:曳其轮，濡其尾，无咎。《象》曰：曳其轮，义无咎也。",
    "name": "既济卦初九爻辞"
  },
  {
    "code": "div010101_5",
    "words": "既济卦 六二爻辞:妇丧其茀，勿逐，七日得。《象》曰：七日得，以中道也。",
    "name": "既济卦六二爻辞"
  },
  {
    "code": "div010101_4",
    "words": "既济卦 九三爻辞:高宗伐鬼方，三年克之，小人勿用。《象》曰：三年克之，惫也。",
    "name": "既济卦九三爻辞"
  },
  {
    "code": "div010101_3",
    "words": "既济卦 六四爻辞:繻有衣袽，终日戒。《象》曰：终日戒，有所疑也。",
    "name": "既济卦六四爻辞"
  },
  {
    "code": "div010101_2",
    "words": "既济卦 九五爻辞:东邻杀牛，不如西邻之禴祭，实受其福。《象》曰：东邻杀牛，不如西邻之时也。实受其福，吉大来也。",
    "name": "既济卦九五爻辞"
  },
  {
    "code": "div010101_1",
    "words": "既济卦 上六爻辞:濡其首，厉。《象》曰：濡其首厉，何可久也。",
    "name": "既济卦上六爻辞"
  },
  {
    "code": "div101010_0",
    "words": "未济卦 卦辞:亨。小狐汔济，濡其尾，无攸利。《象》曰：火在水上，未济。君子以慎辨物居方。",
    "name": "未济卦卦辞"
  },
  {
    "code": "div101010_6",
    "words": "未济卦 初六爻辞:濡其尾，吝。《象》曰：濡其尾，亦不知极也。",
    "name": "未济卦初六爻辞"
  },
  {
    "code": "div101010_5",
    "words": "未济卦 九二爻辞:曳其轮，贞吉。《象》曰：九二贞吉，中以行正也。",
    "name": "未济卦九二爻辞"
  },
  {
    "code": "div101010_4",
    "words": "未济卦 六三爻辞:未济，征凶，利涉大川。《象》曰：未济征凶，位不当也。",
    "name": "未济卦六三爻辞"
  },
  {
    "code": "div101010_3",
    "words": "未济卦 九四爻辞:贞吉，悔亡，震用伐鬼方。三年有赏于大国。《象》曰：贞吉悔亡，志行也。",
    "name": "未济卦九四爻辞"
  },
  {
    "code": "div101010_2",
    "words": "未济卦 六五爻辞:贞吉，无悔。君子之光，有孚，吉。《象》曰：君子之光，其晖吉也。",
    "name": "未济卦六五爻辞"
  },
  {
    "code": "div101010_1",
    "words": "未济卦 上九爻辞:有孚于饮酒，无咎。濡其首，有孚失是。《象》曰：饮酒濡首，亦不知节也。",
    "name": "未济卦上九爻辞"
  },
  {
    "code": "div111111_7",
    "words": "乾卦 用九爻辞：见群龙无首，吉。《象》曰：用九，天德不可为首也。",
    "name": "乾卦用九爻辞"
  },
  {
    "code": "div000000_7",
    "words": "坤卦用六爻辞利，永贞。《象》曰：用六永贞，以大终也。",
    "name": "坤卦用六爻辞"
  },
  {
    "code": "sym111111",
    "words": "乾",
    "name": "乾"
  },
  {
    "code": "sym000000",
    "words": "坤",
    "name": "坤"
  },
  {
    "code": "sym010001",
    "words": "屯",
    "name": "屯"
  },
  {
    "code": "sym100010",
    "words": "蒙",
    "name": "蒙"
  },
  {
    "code": "sym010111",
    "words": "需",
    "name": "需"
  },
  {
    "code": "sym111010",
    "words": "讼",
    "name": "讼"
  },
  {
    "code": "sym000010",
    "words": "师",
    "name": "师"
  },
  {
    "code": "sym010000",
    "words": "比",
    "name": "比"
  },
  {
    "code": "sym110111",
    "words": "小畜",
    "name": "小畜"
  },
  {
    "code": "sym111011",
    "words": "履",
    "name": "履"
  },
  {
    "code": "sym000111",
    "words": "泰",
    "name": "泰"
  },
  {
    "code": "sym111000",
    "words": "否",
    "name": "否"
  },
  {
    "code": "sym111101",
    "words": "同人",
    "name": "同人"
  },
  {
    "code": "sym101111",
    "words": "大有",
    "name": "大有"
  },
  {
    "code": "sym000100",
    "words": "谦",
    "name": "谦"
  },
  {
    "code": "sym001000",
    "words": "豫",
    "name": "豫"
  },
  {
    "code": "sym011001",
    "words": "随",
    "name": "随"
  },
  {
    "code": "sym100110",
    "words": "蛊",
    "name": "蛊"
  },
  {
    "code": "sym000011",
    "words": "临",
    "name": "临"
  },
  {
    "code": "sym110000",
    "words": "观",
    "name": "观"
  },
  {
    "code": "sym101001",
    "words": "噬嗑",
    "name": "噬嗑"
  },
  {
    "code": "sym100101",
    "words": "贲",
    "name": "贲"
  },
  {
    "code": "sym100000",
    "words": "剥",
    "name": "剥"
  },
  {
    "code": "sym000001",
    "words": "复",
    "name": "复"
  },
  {
    "code": "sym111001",
    "words": "无妄",
    "name": "无妄"
  },
  {
    "code": "sym100111",
    "words": "大畜",
    "name": "大畜"
  },
  {
    "code": "sym100001",
    "words": "颐",
    "name": "颐"
  },
  {
    "code": "sym011110",
    "words": "大过",
    "name": "大过"
  },
  {
    "code": "sym010010",
    "words": "坎",
    "name": "坎"
  },
  {
    "code": "sym101101",
    "words": "离",
    "name": "离"
  },
  {
    "code": "sym011100",
    "words": "咸",
    "name": "咸"
  },
  {
    "code": "sym001110",
    "words": "恒",
    "name": "恒"
  },
  {
    "code": "sym111100",
    "words": "遁",
    "name": "遁"
  },
  {
    "code": "sym001111",
    "words": "大壮",
    "name": "大壮"
  },
  {
    "code": "sym101000",
    "words": "晋",
    "name": "晋"
  },
  {
    "code": "sym000101",
    "words": "明夷",
    "name": "明夷"
  },
  {
    "code": "sym110101",
    "words": "家人",
    "name": "家人"
  },
  {
    "code": "sym101011",
    "words": "睽",
    "name": "睽"
  },
  {
    "code": "sym010100",
    "words": "蹇",
    "name": "蹇"
  },
  {
    "code": "sym001010",
    "words": "解",
    "name": "解"
  },
  {
    "code": "sym100011",
    "words": "损",
    "name": "损"
  },
  {
    "code": "sym110001",
    "words": "益",
    "name": "益"
  },
  {
    "code": "sym011111",
    "words": "夬",
    "name": "夬"
  },
  {
    "code": "sym111110",
    "words": "姤",
    "name": "姤"
  },
  {
    "code": "sym011000",
    "words": "萃",
    "name": "萃"
  },
  {
    "code": "sym000110",
    "words": "升",
    "name": "升"
  },
  {
    "code": "sym011010",
    "words": "困",
    "name": "困"
  },
  {
    "code": "sym010110",
    "words": "井",
    "name": "井"
  },
  {
    "code": "sym011101",
    "words": "革",
    "name": "革"
  },
  {
    "code": "sym101110",
    "words": "鼎",
    "name": "鼎"
  },
  {
    "code": "sym001001",
    "words": "震",
    "name": "震"
  },
  {
    "code": "sym100100",
    "words": "艮",
    "name": "艮"
  },
  {
    "code": "sym110100",
    "words": "渐",
    "name": "渐"
  },
  {
    "code": "sym001011",
    "words": "归妹",
    "name": "归妹"
  },
  {
    "code": "sym001101",
    "words": "丰",
    "name": "丰"
  },
  {
    "code": "sym101100",
    "words": "旅",
    "name": "旅"
  },
  {
    "code": "sym110110",
    "words": "巽",
    "name": "巽"
  },
  {
    "code": "sym011011",
    "words": "兑",
    "name": "兑"
  },
  {
    "code": "sym110010",
    "words": "涣",
    "name": "涣"
  },
  {
    "code": "sym010011",
    "words": "节",
    "name": "节"
  },
  {
    "code": "sym110011",
    "words": "中孚",
    "name": "中孚"
  },
  {
    "code": "sym001100",
    "words": "小过",
    "name": "小过"
  },
  {
    "code": "sym010101",
    "words": "既济",
    "name": "既济"
  },
  {
    "code": "sym101010",
    "words": "未济",
    "name": "未济"
  },
  {
    "code": "prepare1",
    "words": "假尔泰筮有常,今以事，未知可否。",
    "name": ""
  },
  {
    "code": "prepare2",
    "words": "爰质所疑于神之灵,吉凶得失、悔吝忧虞,唯尔有神，尚明告之。",
    "name": ""
  },
  {
    "code": "elaborate",
    "words": "这是《易》中的卦/爻辞与注释，两条辞则以前者为主：",
    "name": ""
  },
  {
    "code": "websrch",
    "words": "占卜得到的结果是",
    "name": ""
  }
];
